/* automatically generated by rust-bindgen 0.56.0 */

//! Rust FFI to `SDL2/SDL.h`

#![allow(warnings)]

pub const SDL_AUDIO_DRIVER_COREAUDIO: u32 = 1;
pub const SDL_AUDIO_DRIVER_DISK: u32 = 1;
pub const SDL_AUDIO_DRIVER_DUMMY: u32 = 1;
pub const SDL_JOYSTICK_HIDAPI: u32 = 1;
pub const SDL_JOYSTICK_IOKIT: u32 = 1;
pub const SDL_JOYSTICK_VIRTUAL: u32 = 1;
pub const SDL_HAPTIC_IOKIT: u32 = 1;
pub const SDL_JOYSTICK_MFI: u32 = 1;
pub const SDL_SENSOR_DUMMY: u32 = 1;
pub const SDL_LOADSO_DLOPEN: u32 = 1;
pub const SDL_THREAD_PTHREAD: u32 = 1;
pub const SDL_THREAD_PTHREAD_RECURSIVE_MUTEX: u32 = 1;
pub const SDL_TIMER_UNIX: u32 = 1;
pub const SDL_VIDEO_DRIVER_COCOA: u32 = 1;
pub const SDL_VIDEO_DRIVER_DUMMY: u32 = 1;
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC: &'static [u8; 28usize] = b"/opt/X11/lib/libX11.6.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XEXT: &'static [u8; 29usize] =
    b"/opt/X11/lib/libXext.6.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XINERAMA: &'static [u8; 33usize] =
    b"/opt/X11/lib/libXinerama.1.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XINPUT2: &'static [u8; 27usize] =
    b"/opt/X11/lib/libXi.6.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XRANDR: &'static [u8; 31usize] =
    b"/opt/X11/lib/libXrandr.2.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XSS: &'static [u8; 28usize] =
    b"/opt/X11/lib/libXss.1.dylib\0";
pub const SDL_VIDEO_DRIVER_X11_DYNAMIC_XVIDMODE: &'static [u8; 32usize] =
    b"/opt/X11/lib/libXxf86vm.1.dylib\0";

pub const SDL_HINT_WINDOWS_NO_CLOSE_ON_ALT_F4: &'static [u8; 31usize] =
    b"SDL_WINDOWS_NO_CLOSE_ON_ALT_F4\0";
pub const SDL_HINT_WINDOWS_USE_D3D9EX: &'static [u8; 23usize] = b"SDL_WINDOWS_USE_D3D9EX\0";
pub const SDL_HINT_WINDOW_FRAME_USABLE_WHILE_CURSOR_HIDDEN: &'static [u8; 44usize] =
    b"SDL_WINDOW_FRAME_USABLE_WHILE_CURSOR_HIDDEN\0";
pub const SDL_HINT_WINRT_HANDLE_BACK_BUTTON: &'static [u8; 29usize] =
    b"SDL_WINRT_HANDLE_BACK_BUTTON\0";
pub const SDL_HINT_WINRT_PRIVACY_POLICY_LABEL: &'static [u8; 31usize] =
    b"SDL_WINRT_PRIVACY_POLICY_LABEL\0";
pub const SDL_HINT_WINRT_PRIVACY_POLICY_URL: &'static [u8; 29usize] =
    b"SDL_WINRT_PRIVACY_POLICY_URL\0";
pub const SDL_HINT_X11_FORCE_OVERRIDE_REDIRECT: &'static [u8; 32usize] =
    b"SDL_X11_FORCE_OVERRIDE_REDIRECT\0";
pub const SDL_HINT_XINPUT_ENABLED: &'static [u8; 19usize] = b"SDL_XINPUT_ENABLED\0";
pub const SDL_HINT_XINPUT_USE_OLD_JOYSTICK_MAPPING: &'static [u8; 36usize] =
    b"SDL_XINPUT_USE_OLD_JOYSTICK_MAPPING\0";
pub const SDL_HINT_AUDIO_INCLUDE_MONITORS: &'static [u8; 27usize] = b"SDL_AUDIO_INCLUDE_MONITORS\0";
pub const SDL_MAX_LOG_MESSAGE: u32 = 4096;
pub const SDL_NONSHAPEABLE_WINDOW: i32 = -1;
pub const SDL_INVALID_SHAPE_ARGUMENT: i32 = -2;
pub const SDL_WINDOW_LACKS_SHAPE: i32 = -3;
pub const SDL_MAJOR_VERSION: u32 = 2;
pub const SDL_MINOR_VERSION: u32 = 0;
pub const SDL_PATCHLEVEL: u32 = 17;
pub const SDL_INIT_TIMER: u32 = 1;
pub const SDL_INIT_AUDIO: u32 = 16;
pub const SDL_INIT_VIDEO: u32 = 32;
pub const SDL_INIT_JOYSTICK: u32 = 512;
pub const SDL_INIT_HAPTIC: u32 = 4096;
pub const SDL_INIT_GAMECONTROLLER: u32 = 8192;
pub const SDL_INIT_EVENTS: u32 = 16384;
pub const SDL_INIT_SENSOR: u32 = 32768;
pub const SDL_INIT_NOPARACHUTE: u32 = 1048576;
pub const SDL_INIT_EVERYTHING: u32 = 62001;
extern "C" {
    #[doc = " Get the name of the platform."]
    #[doc = ""]
    #[doc = " Here are the names returned for some (but not all) supported platforms:"]
    #[doc = ""]
    #[doc = " - \"Windows\""]
    #[doc = " - \"Mac OS X\""]
    #[doc = " - \"Linux\""]
    #[doc = " - \"iOS\""]
    #[doc = " - \"Android\""]
    #[doc = ""]
    #[doc = " \\returns the name of the platform. If the correct platform name is not"]
    #[doc = "          available, returns a string beginning with the text \"Unknown\"."]
    pub fn SDL_GetPlatform() -> *const ::std::os::raw::c_char;
}
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_off_t = __int64_t;
pub type size_t = __darwin_size_t;
pub type va_list = __darwin_va_list;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sbuf>()))._base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sbuf>()))._size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._r as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._file as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._bf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._lbfsize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._cookie as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._close as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._read as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._seek as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._write as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ub as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._extra as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_extra)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ur as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ubuf as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._nbuf as *const _ as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._lb as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._blksize as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
}
pub type FILE = __sFILE;
pub type wchar_t = __darwin_wchar_t;
pub const SDL_bool_SDL_FALSE: SDL_bool = 0;
pub const SDL_bool_SDL_TRUE: SDL_bool = 1;
pub type SDL_bool = ::std::os::raw::c_uint;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_compile_time_assert_uint8 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_sint8 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_uint16 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_sint16 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_uint32 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_sint32 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_uint64 = [::std::os::raw::c_int; 1usize];
pub type SDL_compile_time_assert_sint64 = [::std::os::raw::c_int; 1usize];
pub const SDL_DUMMY_ENUM_DUMMY_ENUM_VALUE: SDL_DUMMY_ENUM = 0;
pub type SDL_DUMMY_ENUM = ::std::os::raw::c_uint;
pub type SDL_compile_time_assert_enum = [::std::os::raw::c_int; 1usize];
extern "C" {
    pub fn SDL_malloc(size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_calloc(nmemb: size_t, size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_realloc(
        mem: *mut ::std::os::raw::c_void,
        size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_free(mem: *mut ::std::os::raw::c_void);
}
pub type SDL_malloc_func =
    ::std::option::Option<unsafe extern "C" fn(size: size_t) -> *mut ::std::os::raw::c_void>;
pub type SDL_calloc_func = ::std::option::Option<
    unsafe extern "C" fn(nmemb: size_t, size: size_t) -> *mut ::std::os::raw::c_void,
>;
pub type SDL_realloc_func = ::std::option::Option<
    unsafe extern "C" fn(
        mem: *mut ::std::os::raw::c_void,
        size: size_t,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type SDL_free_func =
    ::std::option::Option<unsafe extern "C" fn(mem: *mut ::std::os::raw::c_void)>;
extern "C" {
    #[doc = " Get the current set of SDL memory functions"]
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
extern "C" {
    #[doc = " Replace SDL's memory allocation functions with a custom set"]
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the number of outstanding (unfreed) allocations"]
    pub fn SDL_GetNumAllocations() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_getenv(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_setenv(
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_qsort(
        base: *mut ::std::os::raw::c_void,
        nmemb: size_t,
        size: size_t,
        compare: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn SDL_abs(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isalpha(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isalnum(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isblank(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_iscntrl(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isdigit(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isxdigit(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_ispunct(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isspace(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isupper(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_islower(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isprint(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_isgraph(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_toupper(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_tolower(x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_crc32(crc: Uint32, data: *const ::std::os::raw::c_void, len: size_t) -> Uint32;
}
extern "C" {
    pub fn SDL_memset(
        dst: *mut ::std::os::raw::c_void,
        c: ::std::os::raw::c_int,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_memcpy(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_memmove(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_memcmp(
        s1: *const ::std::os::raw::c_void,
        s2: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_wcslen(wstr: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcsstr(haystack: *const wchar_t, needle: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_wcsncmp(
        str1: *const wchar_t,
        str2: *const wchar_t,
        maxlen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_wcscasecmp(str1: *const wchar_t, str2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_wcsncasecmp(
        str1: *const wchar_t,
        str2: *const wchar_t,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_strlen(str_: *const ::std::os::raw::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_utf8strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        dst_bytes: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strdup(str_: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strrev(str_: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strupr(str_: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strlwr(str_: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strchr(
        str_: *const ::std::os::raw::c_char,
        c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strrchr(
        str_: *const ::std::os::raw::c_char,
        c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strstr(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_strtokr(
        s1: *mut ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        saveptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_utf8strlen(str_: *const ::std::os::raw::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_itoa(
        value: ::std::os::raw::c_int,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_uitoa(
        value: ::std::os::raw::c_uint,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: ::std::os::raw::c_long,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: ::std::os::raw::c_ulong,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        str_: *mut ::std::os::raw::c_char,
        radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_atoi(str_: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_atof(str_: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strtol(
        str_: *const ::std::os::raw::c_char,
        endp: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn SDL_strtoul(
        str_: *const ::std::os::raw::c_char,
        endp: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn SDL_strtoll(
        str_: *const ::std::os::raw::c_char,
        endp: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> Sint64;
}
extern "C" {
    pub fn SDL_strtoull(
        str_: *const ::std::os::raw::c_char,
        endp: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> Uint64;
}
extern "C" {
    pub fn SDL_strtod(
        str_: *const ::std::os::raw::c_char,
        endp: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn SDL_strcmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_strncmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
        maxlen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_strcasecmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_strncasecmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_sscanf(
        text: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_vsscanf(
        text: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_snprintf(
        text: *mut ::std::os::raw::c_char,
        maxlen: size_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_vsnprintf(
        text: *mut ::std::os::raw::c_char,
        maxlen: size_t,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_acos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_acosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_asin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_asinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atanf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan2(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_atan2f(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_ceil(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_cos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_cosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_exp(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_expf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fabs(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_floor(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_floorf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_trunc(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_truncf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_log(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_logf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_log10(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_log10f(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_round(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_roundf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_lround(x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn SDL_lroundf(x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn SDL_scalbn(x: f64, n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn SDL_scalbnf(x: f32, n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn SDL_sin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const ::std::os::raw::c_char,
        fromcode: *const ::std::os::raw::c_char,
    ) -> SDL_iconv_t;
}
extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const ::std::os::raw::c_char,
        inbytesleft: *mut size_t,
        outbuf: *mut *mut ::std::os::raw::c_char,
        outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " This function converts a string between encodings in one pass, returning a"]
    #[doc = " string that must be freed with SDL_free() or NULL on error."]
    pub fn SDL_iconv_string(
        tocode: *const ::std::os::raw::c_char,
        fromcode: *const ::std::os::raw::c_char,
        inbuf: *const ::std::os::raw::c_char,
        inbytesleft: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
#[doc = "  The prototype for the application's main() function"]
pub type SDL_main_func = ::std::option::Option<
    unsafe extern "C" fn(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn SDL_main(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Circumvent failure of SDL_Init() when not using SDL_main() as an entry"]
    #[doc = " point."]
    #[doc = ""]
    #[doc = " This function is defined in SDL_main.h, along with the preprocessor rule to"]
    #[doc = " redefine main() as SDL_main(). Thus to ensure that your main() function"]
    #[doc = " will not be changed it is necessary to define SDL_MAIN_HANDLED before"]
    #[doc = " including SDL.h."]
    #[doc = ""]
    #[doc = " \\sa SDL_Init"]
    pub fn SDL_SetMainReady();
}
#[doc = "< Retry the assert immediately."]
pub const SDL_AssertState_SDL_ASSERTION_RETRY: SDL_AssertState = 0;
#[doc = "< Make the debugger trigger a breakpoint."]
pub const SDL_AssertState_SDL_ASSERTION_BREAK: SDL_AssertState = 1;
#[doc = "< Terminate the program."]
pub const SDL_AssertState_SDL_ASSERTION_ABORT: SDL_AssertState = 2;
#[doc = "< Ignore the assert."]
pub const SDL_AssertState_SDL_ASSERTION_IGNORE: SDL_AssertState = 3;
#[doc = "< Ignore the assert from now on."]
pub const SDL_AssertState_SDL_ASSERTION_ALWAYS_IGNORE: SDL_AssertState = 4;
pub type SDL_AssertState = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: ::std::os::raw::c_int,
    pub trigger_count: ::std::os::raw::c_uint,
    pub condition: *const ::std::os::raw::c_char,
    pub filename: *const ::std::os::raw::c_char,
    pub linenum: ::std::os::raw::c_int,
    pub function: *const ::std::os::raw::c_char,
    pub next: *const SDL_AssertData,
}
#[test]
fn bindgen_test_layout_SDL_AssertData() {
    assert_eq!(
        ::std::mem::size_of::<SDL_AssertData>(),
        48usize,
        concat!("Size of: ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_AssertData>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).always_ignore as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(always_ignore)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).trigger_count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(trigger_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).condition as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).linenum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(linenum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).function as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AssertData>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> SDL_AssertState;
}
#[doc = " A callback that fires when an SDL assertion fails."]
#[doc = ""]
#[doc = " \\param data a pointer to the SDL_AssertData structure corresponding to the"]
#[doc = "             current assertion"]
#[doc = " \\param userdata what was passed as `userdata` to SDL_SetAssertionHandler()"]
#[doc = " \\returns an SDL_AssertState value indicating how to handle the failure."]
pub type SDL_AssertionHandler = ::std::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut ::std::os::raw::c_void,
    ) -> SDL_AssertState,
>;
extern "C" {
    #[doc = " Set an application-defined assertion handler."]
    #[doc = ""]
    #[doc = " This function allows an application to show its own assertion UI and/or"]
    #[doc = " force the response to an assertion failure. If the application doesn't"]
    #[doc = " provide this, SDL will try to do the right thing, popping up a"]
    #[doc = " system-specific GUI dialog, and probably minimizing any fullscreen windows."]
    #[doc = ""]
    #[doc = " This callback may fire from any thread, but it runs wrapped in a mutex, so"]
    #[doc = " it will only fire from one thread at a time."]
    #[doc = ""]
    #[doc = " This callback is NOT reset to SDL's internal handler upon SDL_Quit()!"]
    #[doc = ""]
    #[doc = " \\param handler the SDL_AssertionHandler function to call when an assertion"]
    #[doc = "                fails or NULL for the default handler"]
    #[doc = " \\param userdata a pointer that is passed to `handler`"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionHandler"]
    pub fn SDL_SetAssertionHandler(
        handler: SDL_AssertionHandler,
        userdata: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Get the default assertion handler."]
    #[doc = ""]
    #[doc = " This returns the function pointer that is called by default when an"]
    #[doc = " assertion is triggered. This is an internal function provided by SDL, that"]
    #[doc = " is used for assertions when SDL_SetAssertionHandler() hasn't been used to"]
    #[doc = " provide a different function."]
    #[doc = ""]
    #[doc = " \\returns the default SDL_AssertionHandler that is called when an assert"]
    #[doc = "          triggers."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionHandler"]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = " Get the current assertion handler."]
    #[doc = ""]
    #[doc = " This returns the function pointer that is called when an assertion is"]
    #[doc = " triggered. This is either the value last passed to"]
    #[doc = " SDL_SetAssertionHandler(), or if no application-specified function is set,"]
    #[doc = " is equivalent to calling SDL_GetDefaultAssertionHandler()."]
    #[doc = ""]
    #[doc = " The parameter `puserdata` is a pointer to a void*, which will store the"]
    #[doc = " \"userdata\" pointer that was passed to SDL_SetAssertionHandler(). This value"]
    #[doc = " will always be NULL for the default handler. If you don't care about this"]
    #[doc = " data, it is safe to pass a NULL pointer to this function to ignore it."]
    #[doc = ""]
    #[doc = " \\param puserdata pointer which is filled with the \"userdata\" pointer that"]
    #[doc = "                  was passed to SDL_SetAssertionHandler()"]
    #[doc = " \\returns the SDL_AssertionHandler that is called when an assert triggers."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetAssertionHandler"]
    pub fn SDL_GetAssertionHandler(
        puserdata: *mut *mut ::std::os::raw::c_void,
    ) -> SDL_AssertionHandler;
}
extern "C" {
    #[doc = " Get a list of all assertion failures."]
    #[doc = ""]
    #[doc = " This function gets all assertions triggered since the last call to"]
    #[doc = " SDL_ResetAssertionReport(), or the start of the program."]
    #[doc = ""]
    #[doc = " The proper way to examine this data looks something like this:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " const SDL_AssertData *item = SDL_GetAssertionReport();"]
    #[doc = " while (item) {"]
    #[doc = "    printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\","]
    #[doc = "           item->condition, item->function, item->filename,"]
    #[doc = "           item->linenum, item->trigger_count,"]
    #[doc = "           item->always_ignore ? \"yes\" : \"no\");"]
    #[doc = "    item = item->next;"]
    #[doc = " }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\returns a list of all failed assertions or NULL if the list is empty. This"]
    #[doc = "          memory should not be modified or freed by the application."]
    #[doc = ""]
    #[doc = " \\sa SDL_ResetAssertionReport"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
extern "C" {
    #[doc = " Clear the list of all assertion failures."]
    #[doc = ""]
    #[doc = " This function will clear the list of all assertions triggered up to that"]
    #[doc = " point. Immediately following this call, SDL_GetAssertionReport will return"]
    #[doc = " no items. In addition, any previously-triggered assertions will be reset to"]
    #[doc = " a trigger_count of zero, and their always_ignore state will be false."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAssertionReport"]
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = ::std::os::raw::c_int;
extern "C" {
    #[doc = " Try to lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = " \\returns SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already"]
    #[doc = "          held."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicLock"]
    #[doc = " \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
extern "C" {
    #[doc = " Lock a spin lock by setting it to a non-zero value."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicTryLock"]
    #[doc = " \\sa SDL_AtomicUnlock"]
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Unlock a spin lock by setting it to 0."]
    #[doc = ""]
    #[doc = " Always returns immediately."]
    #[doc = ""]
    #[doc = " ***Please note that spinlocks are dangerous if you don't know what you're"]
    #[doc = " doing. Please be careful using any sort of spinlock!***"]
    #[doc = ""]
    #[doc = " \\param lock a pointer to a lock variable"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicLock"]
    #[doc = " \\sa SDL_AtomicTryLock"]
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
extern "C" {
    #[doc = " Memory barriers are designed to prevent reads and writes from being"]
    #[doc = " reordered by the compiler and being seen out of order on multi-core CPUs."]
    #[doc = ""]
    #[doc = " A typical pattern would be for thread A to write some data and a flag, and"]
    #[doc = " for thread B to read the flag and get the data. In this case you would"]
    #[doc = " insert a release barrier between writing the data and the flag,"]
    #[doc = " guaranteeing that the data write completes no later than the flag is"]
    #[doc = " written, and you would insert an acquire barrier between reading the flag"]
    #[doc = " and reading the data, to ensure that all the reads associated with the flag"]
    #[doc = " have completed."]
    #[doc = ""]
    #[doc = " In this pattern you should always see a release barrier paired with an"]
    #[doc = " acquire barrier and you should gate the data reads/writes with a single"]
    #[doc = " flag variable."]
    #[doc = ""]
    #[doc = " For more information on these semantics, take a look at the blog post:"]
    #[doc = " http://preshing.com/20120913/acquire-and-release-semantics"]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " \\brief A type representing an atomic integer value.  It is a struct"]
#[doc = "        so people don't accidentally use numeric operations on it."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_atomic_t() {
    assert_eq!(
        ::std::mem::size_of::<SDL_atomic_t>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_atomic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_atomic_t>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_atomic_t),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    #[doc = " Set an atomic variable to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param oldval the old value"]
    #[doc = " \\param newval the new value"]
    #[doc = " \\returns SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicGet"]
    #[doc = " \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: ::std::os::raw::c_int,
        newval: ::std::os::raw::c_int,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Set an atomic variable to a value."]
    #[doc = ""]
    #[doc = " This function also acts as a full memory barrier."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param v the desired value"]
    #[doc = " \\returns the previous value of the atomic variable."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicGet"]
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the value of an atomic variable."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable"]
    #[doc = " \\returns the current value of an atomic variable."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicSet"]
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Add to an atomic variable."]
    #[doc = ""]
    #[doc = " This function also acts as a full memory barrier."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to an SDL_atomic_t variable to be modified"]
    #[doc = " \\param v the desired value to add"]
    #[doc = " \\returns the previous value of the atomic variable."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicDecRef"]
    #[doc = " \\sa SDL_AtomicIncRef"]
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set a pointer to a new value if it is currently an old value."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\param oldval the old pointer value"]
    #[doc = " \\param newval the new pointer value"]
    #[doc = " \\returns SDL_TRUE if the pointer was set, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCAS"]
    #[doc = " \\sa SDL_AtomicGetPtr"]
    #[doc = " \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut ::std::os::raw::c_void,
        oldval: *mut ::std::os::raw::c_void,
        newval: *mut ::std::os::raw::c_void,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Set a pointer to a value atomically."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\param v the desired pointer value"]
    #[doc = " \\returns the previous value of the pointer."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicGetPtr"]
    pub fn SDL_AtomicSetPtr(
        a: *mut *mut ::std::os::raw::c_void,
        v: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Get the value of a pointer atomically."]
    #[doc = ""]
    #[doc = " ***Note: If you don't know what this function is for, you shouldn't use"]
    #[doc = " it!***"]
    #[doc = ""]
    #[doc = " \\param a a pointer to a pointer"]
    #[doc = " \\returns the current value of a pointer."]
    #[doc = ""]
    #[doc = " \\sa SDL_AtomicCASPtr"]
    #[doc = " \\sa SDL_AtomicSetPtr"]
    pub fn SDL_AtomicGetPtr(a: *mut *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Set the SDL error message for the current thread."]
    #[doc = ""]
    #[doc = " Calling this function will replace any previous error message that was set."]
    #[doc = ""]
    #[doc = " This function always returns -1, since SDL frequently uses -1 to signify an"]
    #[doc = " failing result, leading to this idiom:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " if (error_code) {"]
    #[doc = "     return SDL_SetError(\"This operation has failed: %d\", error_code);"]
    #[doc = " }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param fmt a printf()-style message format string"]
    #[doc = " \\param ... additional parameters matching % tokens in the `fmt` string, if"]
    #[doc = "            any"]
    #[doc = " \\returns always -1."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearError"]
    #[doc = " \\sa SDL_GetError"]
    pub fn SDL_SetError(fmt: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Retrieve a message about the last error that occurred on the current"]
    #[doc = " thread."]
    #[doc = ""]
    #[doc = " It is possible for multiple errors to occur before calling SDL_GetError()."]
    #[doc = " Only the last error is returned."]
    #[doc = ""]
    #[doc = " The message is only applicable when an SDL function has signaled an error."]
    #[doc = " You must check the return values of SDL function calls to determine when to"]
    #[doc = " appropriately call SDL_GetError(). You should _not_ use the results of"]
    #[doc = " SDL_GetError() to decide if an error has occurred! Sometimes SDL will set"]
    #[doc = " an error string even when reporting success."]
    #[doc = ""]
    #[doc = " SDL will _not_ clear the error string for successful API calls. You _must_"]
    #[doc = " check return values for failure cases before you can assume the error"]
    #[doc = " string applies."]
    #[doc = ""]
    #[doc = " Error strings are set per-thread, so an error set in a different thread"]
    #[doc = " will not interfere with the current thread's operation."]
    #[doc = ""]
    #[doc = " The returned string is internally allocated and must not be freed by the"]
    #[doc = " application."]
    #[doc = ""]
    #[doc = " \\returns a message with information about the specific error that occurred,"]
    #[doc = "          or an empty string if there hasn't been an error message set since"]
    #[doc = "          the last call to SDL_ClearError(). The message is only applicable"]
    #[doc = "          when an SDL function has signaled an error. You must check the"]
    #[doc = "          return values of SDL function calls to determine when to"]
    #[doc = "          appropriately call SDL_GetError()."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearError"]
    #[doc = " \\sa SDL_SetError"]
    pub fn SDL_GetError() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the last error message that was set for the current thread."]
    #[doc = ""]
    #[doc = " This allows the caller to copy the error string into a provided buffer, but"]
    #[doc = " otherwise operates exactly the same as SDL_GetError()."]
    #[doc = ""]
    #[doc = " \\param errstr A buffer to fill with the last error message that was set for"]
    #[doc = "               the current thread"]
    #[doc = " \\param maxlen The size of the buffer pointed to by the errstr parameter"]
    #[doc = " \\returns the pointer passed in as the `errstr` parameter."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetError"]
    pub fn SDL_GetErrorMsg(
        errstr: *mut ::std::os::raw::c_char,
        maxlen: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Clear any previous error message for this thread."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetError"]
    #[doc = " \\sa SDL_SetError"]
    pub fn SDL_ClearError();
}
pub const SDL_errorcode_SDL_ENOMEM: SDL_errorcode = 0;
pub const SDL_errorcode_SDL_EFREAD: SDL_errorcode = 1;
pub const SDL_errorcode_SDL_EFWRITE: SDL_errorcode = 2;
pub const SDL_errorcode_SDL_EFSEEK: SDL_errorcode = 3;
pub const SDL_errorcode_SDL_UNSUPPORTED: SDL_errorcode = 4;
pub const SDL_errorcode_SDL_LASTERROR: SDL_errorcode = 5;
pub type SDL_errorcode = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a new mutex."]
    #[doc = ""]
    #[doc = " All newly-created mutexes begin in the _unlocked_ state."]
    #[doc = ""]
    #[doc = " Calls to SDL_LockMutex() will not return while the mutex is locked by"]
    #[doc = " another thread. See SDL_TryLockMutex() to attempt to lock without blocking."]
    #[doc = ""]
    #[doc = " SDL mutexes are reentrant."]
    #[doc = ""]
    #[doc = " \\returns the initialized and unlocked mutex or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_DestroyMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_TryLockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    #[doc = " Lock the mutex."]
    #[doc = ""]
    #[doc = " This will block until the mutex is available, which is to say it is in the"]
    #[doc = " unlocked state and the OS has chosen the caller as the next thread to lock"]
    #[doc = " it. Of all threads waiting to lock the mutex, only one may do so at a time."]
    #[doc = ""]
    #[doc = " It is legal for the owning thread to lock an already-locked mutex. It must"]
    #[doc = " unlock it the same number of times before it is actually made available for"]
    #[doc = " other threads in the system (this is known as a \"recursive mutex\")."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to lock"]
    #[doc = " \\return 0, or -1 on error."]
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Try to lock a mutex without blocking."]
    #[doc = ""]
    #[doc = " This works just like SDL_LockMutex(), but if the mutex is not available,"]
    #[doc = " this function returns `SDL_MUTEX_TIMEOUT` immediately."]
    #[doc = ""]
    #[doc = " This technique is useful if you need exclusive access to a resource but"]
    #[doc = " don't want to wait for it, and will return to it to try again later."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to try to lock"]
    #[doc = " \\returns 0, `SDL_MUTEX_TIMEDOUT`, or -1 on error; call SDL_GetError() for"]
    #[doc = "          more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateMutex"]
    #[doc = " \\sa SDL_DestroyMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Unlock the mutex."]
    #[doc = ""]
    #[doc = " It is legal for the owning thread to lock an already-locked mutex. It must"]
    #[doc = " unlock it the same number of times before it is actually made available for"]
    #[doc = " other threads in the system (this is known as a \"recursive mutex\")."]
    #[doc = ""]
    #[doc = " It is an error to unlock a mutex that has not been locked by the current"]
    #[doc = " thread, and doing so results in undefined behavior."]
    #[doc = ""]
    #[doc = " It is also an error to unlock a mutex that isn't locked at all."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to unlock."]
    #[doc = " \\returns 0, or -1 on error."]
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Destroy a mutex created with SDL_CreateMutex()."]
    #[doc = ""]
    #[doc = " This function must be called on any mutex that is no longer needed. Failure"]
    #[doc = " to destroy a mutex will result in a system memory or resource leak. While"]
    #[doc = " it is safe to destroy a mutex that is _unlocked_, it is not safe to attempt"]
    #[doc = " to destroy a locked mutex, and may result in undefined behavior depending"]
    #[doc = " on the platform."]
    #[doc = ""]
    #[doc = " \\param mutex the mutex to destroy"]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateMutex"]
    #[doc = " \\sa SDL_LockMutex"]
    #[doc = " \\sa SDL_TryLockMutex"]
    #[doc = " \\sa SDL_UnlockMutex"]
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    #[doc = " Create a semaphore."]
    #[doc = ""]
    #[doc = " This function creates a new semaphore and initializes it with the value"]
    #[doc = " `initial_value`. Each wait operation on the semaphore will atomically"]
    #[doc = " decrement the semaphore value and potentially block if the semaphore value"]
    #[doc = " is 0. Each post operation will atomically increment the semaphore value and"]
    #[doc = " wake waiting threads and allow them to retry the wait operation."]
    #[doc = ""]
    #[doc = " \\param initial_value the starting value of the semaphore"]
    #[doc = " \\returns a new semaphore or NULL on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    #[doc = " Destroy a semaphore."]
    #[doc = ""]
    #[doc = " It is not safe to destroy a semaphore if there are threads currently"]
    #[doc = " waiting on it."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to destroy"]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it."]
    #[doc = ""]
    #[doc = " This function suspends the calling thread until either the semaphore"]
    #[doc = " pointed to by `sem` has a positive value or the call is interrupted by a"]
    #[doc = " signal or error. If the call is successful it will atomically decrement the"]
    #[doc = " semaphore value."]
    #[doc = ""]
    #[doc = " This function is the equivalent of calling SDL_SemWaitTimeout() with a time"]
    #[doc = " length of `SDL_MUTEX_MAXWAIT`."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore wait on"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " See if a semaphore has a positive value and decrement it if it does."]
    #[doc = ""]
    #[doc = " This function checks to see if the semaphore pointed to by `sem` has a"]
    #[doc = " positive value and atomically decrements the semaphore value if it does. If"]
    #[doc = " the semaphore doesn't have a positive value, the function immediately"]
    #[doc = " returns SDL_MUTEX_TIMEDOUT."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to wait on"]
    #[doc = " \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait would"]
    #[doc = "          block, or a negative error code on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Wait until a semaphore has a positive value and then decrements it."]
    #[doc = ""]
    #[doc = " This function suspends the calling thread until either the semaphore"]
    #[doc = " pointed to by `sem` has a positive value, the call is interrupted by a"]
    #[doc = " signal or error, or the specified time has elapsed. If the call is"]
    #[doc = " successful it will atomically decrement the semaphore value."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to wait on"]
    #[doc = " \\param ms the length of the timeout, in milliseconds"]
    #[doc = " \\returns 0 if the wait succeeds, `SDL_MUTEX_TIMEDOUT` if the wait does not"]
    #[doc = "          succeed in the allotted time, or a negative error code on failure;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemPost"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Atomically increment a semaphore's value and wake waiting threads."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to increment"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    #[doc = " \\sa SDL_DestroySemaphore"]
    #[doc = " \\sa SDL_SemTryWait"]
    #[doc = " \\sa SDL_SemValue"]
    #[doc = " \\sa SDL_SemWait"]
    #[doc = " \\sa SDL_SemWaitTimeout"]
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the current value of a semaphore."]
    #[doc = ""]
    #[doc = " \\param sem the semaphore to query"]
    #[doc = " \\returns the current value of the semaphore."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateSemaphore"]
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a condition variable."]
    #[doc = ""]
    #[doc = " \\returns a new condition variable or NULL on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    #[doc = " Destroy a condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to destroy"]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    #[doc = " Restart one of the threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to signal"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Restart all threads that are waiting on the condition variable."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to signal"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Wait until a condition variable is signaled."]
    #[doc = ""]
    #[doc = " This function unlocks the specified `mutex` and waits for another thread to"]
    #[doc = " call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable"]
    #[doc = " `cond`. Once the condition variable is signaled, the mutex is re-locked and"]
    #[doc = " the function returns."]
    #[doc = ""]
    #[doc = " The mutex must be locked before calling this function."]
    #[doc = ""]
    #[doc = " This function is the equivalent of calling SDL_CondWaitTimeout() with a"]
    #[doc = " time length of `SDL_MUTEX_MAXWAIT`."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to wait on"]
    #[doc = " \\param mutex the mutex used to coordinate thread access"]
    #[doc = " \\returns 0 when it is signaled or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWaitTimeout"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Wait until a condition variable is signaled or a certain time has passed."]
    #[doc = ""]
    #[doc = " This function unlocks the specified `mutex` and waits for another thread to"]
    #[doc = " call SDL_CondSignal() or SDL_CondBroadcast() on the condition variable"]
    #[doc = " `cond`, or for the specified time to elapse. Once the condition variable is"]
    #[doc = " signaled or the time elapsed, the mutex is re-locked and the function"]
    #[doc = " returns."]
    #[doc = ""]
    #[doc = " The mutex must be locked before calling this function."]
    #[doc = ""]
    #[doc = " \\param cond the condition variable to wait on"]
    #[doc = " \\param mutex the mutex used to coordinate thread access"]
    #[doc = " \\param ms the maximum time to wait, in milliseconds, or `SDL_MUTEX_MAXWAIT`"]
    #[doc = "           to wait indefinitely"]
    #[doc = " \\returns 0 if the condition variable is signaled, `SDL_MUTEX_TIMEDOUT` if"]
    #[doc = "          the condition is not signaled in the allotted time, or a negative"]
    #[doc = "          error code on failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CondBroadcast"]
    #[doc = " \\sa SDL_CondSignal"]
    #[doc = " \\sa SDL_CondWait"]
    #[doc = " \\sa SDL_CreateCond"]
    #[doc = " \\sa SDL_DestroyCond"]
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = ::std::os::raw::c_ulong;
pub type SDL_TLSID = ::std::os::raw::c_uint;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_LOW: SDL_ThreadPriority = 0;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_NORMAL: SDL_ThreadPriority = 1;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_HIGH: SDL_ThreadPriority = 2;
pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_TIME_CRITICAL: SDL_ThreadPriority = 3;
#[doc = "  The SDL thread priority."]
#[doc = ""]
#[doc = "  SDL will make system changes as necessary in order to apply the thread priority."]
#[doc = "  Code which attempts to control thread state related to priority should be aware"]
#[doc = "  that calling SDL_SetThreadPriority may alter such state."]
#[doc = "  SDL_HINT_THREAD_PRIORITY_POLICY can be used to control aspects of this behavior."]
#[doc = ""]
#[doc = "  \\note On many systems you require special privileges to set high or time critical priority."]
pub type SDL_ThreadPriority = ::std::os::raw::c_uint;
#[doc = " The function passed to SDL_CreateThread()."]
#[doc = ""]
#[doc = " \\param data what was passed as `data` to SDL_CreateThread()"]
#[doc = " \\returns a value that can be reported through SDL_WaitThread()."]
pub type SDL_ThreadFunction = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " Create a new thread with a default stack size."]
    #[doc = ""]
    #[doc = " This is equivalent to calling:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " SDL_CreateThreadWithStackSize(fn, name, 0, data);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param fn the SDL_ThreadFunction function to call in the new thread"]
    #[doc = " \\param name the name of the thread"]
    #[doc = " \\param data a pointer that is passed to `fn`"]
    #[doc = " \\returns an opaque pointer to the new thread object on success, NULL if the"]
    #[doc = "          new thread could not be created; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThreadWithStackSize"]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Create a new thread with a specific stack size."]
    #[doc = ""]
    #[doc = " SDL makes an attempt to report `name` to the system, so that debuggers can"]
    #[doc = " display it. Not all platforms support this."]
    #[doc = ""]
    #[doc = " Thread naming is a little complicated: Most systems have very small limits"]
    #[doc = " for the string length (Haiku has 32 bytes, Linux currently has 16, Visual"]
    #[doc = " C++ 6.0 has _nine_!), and possibly other arbitrary rules. You'll have to"]
    #[doc = " see what happens with your system's debugger. The name should be UTF-8 (but"]
    #[doc = " using the naming limits of C identifiers is a better bet). There are no"]
    #[doc = " requirements for thread naming conventions, so long as the string is"]
    #[doc = " null-terminated UTF-8, but these guidelines are helpful in choosing a name:"]
    #[doc = ""]
    #[doc = " https://stackoverflow.com/questions/149932/naming-conventions-for-threads"]
    #[doc = ""]
    #[doc = " If a system imposes requirements, SDL will try to munge the string for it"]
    #[doc = " (truncate, etc), but the original string contents will be available from"]
    #[doc = " SDL_GetThreadName()."]
    #[doc = ""]
    #[doc = " The size (in bytes) of the new stack can be specified. Zero means \"use the"]
    #[doc = " system default\" which might be wildly different between platforms. x86"]
    #[doc = " Linux generally defaults to eight megabytes, an embedded device might be a"]
    #[doc = " few kilobytes instead. You generally need to specify a stack that is a"]
    #[doc = " multiple of the system's page size (in many cases, this is 4 kilobytes, but"]
    #[doc = " check your system documentation)."]
    #[doc = ""]
    #[doc = " In SDL 2.1, stack size will be folded into the original SDL_CreateThread"]
    #[doc = " function, but for backwards compatibility, this is currently a separate"]
    #[doc = " function."]
    #[doc = ""]
    #[doc = " \\param fn the SDL_ThreadFunction function to call in the new thread"]
    #[doc = " \\param name the name of the thread"]
    #[doc = " \\param stacksize the size, in bytes, to allocate for the new thread stack."]
    #[doc = " \\param data a pointer that is passed to `fn`"]
    #[doc = " \\returns an opaque pointer to the new thread object on success, NULL if the"]
    #[doc = "          new thread could not be created; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const ::std::os::raw::c_char,
        stacksize: size_t,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    #[doc = " Get the thread name as it was specified in SDL_CreateThread()."]
    #[doc = ""]
    #[doc = " This is internal memory, not to be freed by the caller, and remains valid"]
    #[doc = " until the specified thread is cleaned up by SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " \\param thread the thread to query"]
    #[doc = " \\returns a pointer to a UTF-8 string that names the specified thread, or"]
    #[doc = "          NULL if it doesn't have a name."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the thread identifier for the current thread."]
    #[doc = ""]
    #[doc = " This thread identifier is as reported by the underlying operating system."]
    #[doc = " If SDL is running on a platform that does not support threads the return"]
    #[doc = " value will always be zero."]
    #[doc = ""]
    #[doc = " This function also returns a valid thread ID when called from the main"]
    #[doc = " thread."]
    #[doc = ""]
    #[doc = " \\returns the ID of the current thread."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetThreadID"]
    pub fn SDL_ThreadID() -> SDL_threadID;
}
extern "C" {
    #[doc = " Get the thread identifier for the specified thread."]
    #[doc = ""]
    #[doc = " This thread identifier is as reported by the underlying operating system."]
    #[doc = " If SDL is running on a platform that does not support threads the return"]
    #[doc = " value will always be zero."]
    #[doc = ""]
    #[doc = " \\param thread the thread to query"]
    #[doc = " \\returns the ID of the specified thread, or the ID of the current thread if"]
    #[doc = "          `thread` is NULL."]
    #[doc = ""]
    #[doc = " \\sa SDL_ThreadID"]
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
extern "C" {
    #[doc = " Set the priority for the current thread."]
    #[doc = ""]
    #[doc = " Note that some platforms will not let you alter the priority (or at least,"]
    #[doc = " promote the thread to a higher priority) at all, and some require you to be"]
    #[doc = " an administrator account. Be prepared for this to fail."]
    #[doc = ""]
    #[doc = " \\param priority the SDL_ThreadPriority to set"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Wait for a thread to finish."]
    #[doc = ""]
    #[doc = " Threads that haven't been detached will remain (as a \"zombie\") until this"]
    #[doc = " function cleans them up. Not doing so is a resource leak."]
    #[doc = ""]
    #[doc = " Once a thread has been cleaned up through this function, the SDL_Thread"]
    #[doc = " that references it becomes invalid and should not be referenced again. As"]
    #[doc = " such, only one thread may call SDL_WaitThread() on another."]
    #[doc = ""]
    #[doc = " The return code for the thread function is placed in the area pointed to by"]
    #[doc = " `status`, if `status` is not NULL."]
    #[doc = ""]
    #[doc = " You may not wait on a thread that has been used in a call to"]
    #[doc = " SDL_DetachThread(). Use either that function or this one, but not both, or"]
    #[doc = " behavior is undefined."]
    #[doc = ""]
    #[doc = " It is safe to pass a NULL thread to this function; it is a no-op."]
    #[doc = ""]
    #[doc = " Note that the thread pointer is freed by this function and is not valid"]
    #[doc = " afterward."]
    #[doc = ""]
    #[doc = " \\param thread the SDL_Thread pointer that was returned from the"]
    #[doc = "               SDL_CreateThread() call that started this thread"]
    #[doc = " \\param status pointer to an integer that will receive the value returned"]
    #[doc = "               from the thread function by its 'return', or NULL to not"]
    #[doc = "               receive such value back."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    #[doc = " \\sa SDL_DetachThread"]
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Let a thread clean up on exit without intervention."]
    #[doc = ""]
    #[doc = " A thread may be \"detached\" to signify that it should not remain until"]
    #[doc = " another thread has called SDL_WaitThread() on it. Detaching a thread is"]
    #[doc = " useful for long-running threads that nothing needs to synchronize with or"]
    #[doc = " further manage. When a detached thread is done, it simply goes away."]
    #[doc = ""]
    #[doc = " There is no way to recover the return code of a detached thread. If you"]
    #[doc = " need this, don't detach the thread and instead use SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " Once a thread is detached, you should usually assume the SDL_Thread isn't"]
    #[doc = " safe to reference again, as it will become invalid immediately upon the"]
    #[doc = " detached thread's exit, instead of remaining until someone has called"]
    #[doc = " SDL_WaitThread() to finally clean it up. As such, don't detach the same"]
    #[doc = " thread more than once."]
    #[doc = ""]
    #[doc = " If a thread has already exited when passed to SDL_DetachThread(), it will"]
    #[doc = " stop waiting for a call to SDL_WaitThread() and clean up immediately. It is"]
    #[doc = " not safe to detach a thread that might be used with SDL_WaitThread()."]
    #[doc = ""]
    #[doc = " You may not call SDL_WaitThread() on a thread that has been detached. Use"]
    #[doc = " either that function or this one, but not both, or behavior is undefined."]
    #[doc = ""]
    #[doc = " It is safe to pass NULL to this function; it is a no-op."]
    #[doc = ""]
    #[doc = " \\param thread the SDL_Thread pointer that was returned from the"]
    #[doc = "               SDL_CreateThread() call that started this thread"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateThread"]
    #[doc = " \\sa SDL_WaitThread"]
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
extern "C" {
    #[doc = " Create a piece of thread-local storage."]
    #[doc = ""]
    #[doc = " This creates an identifier that is globally visible to all threads but"]
    #[doc = " refers to data that is thread-specific."]
    #[doc = ""]
    #[doc = " \\returns the newly created thread local storage identifier or 0 on error."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSGet"]
    #[doc = " \\sa SDL_TLSSet"]
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
extern "C" {
    #[doc = " Get the current thread's value associated with a thread local storage ID."]
    #[doc = ""]
    #[doc = " \\param id the thread local storage ID"]
    #[doc = " \\returns the value associated with the ID for the current thread or NULL if"]
    #[doc = "          no value has been set; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSCreate"]
    #[doc = " \\sa SDL_TLSSet"]
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Set the current thread's value associated with a thread local storage ID."]
    #[doc = ""]
    #[doc = " The function prototype for `destructor` is:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " void destructor(void *value)"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " where its parameter `value` is what was passed as `value` to SDL_TLSSet()."]
    #[doc = ""]
    #[doc = " \\param id the thread local storage ID"]
    #[doc = " \\param value the value to associate with the ID for the current thread"]
    #[doc = " \\param destructor a function called when the thread exits, to free the"]
    #[doc = "                   value"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_TLSCreate"]
    #[doc = " \\sa SDL_TLSGet"]
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const ::std::os::raw::c_void,
        destructor: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Cleanup all TLS data for this thread."]
    pub fn SDL_TLSCleanup();
}
#[doc = " This is the read/write operation structure -- very basic."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    #[doc = "  Return the size of the file in this rwops, or -1 if unknown"]
    pub size: ::std::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    #[doc = "  Seek to \\c offset relative to \\c whence, one of stdio's whence values:"]
    #[doc = "  RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END"]
    #[doc = ""]
    #[doc = "  \\return the final offset in the data stream, or -1 on error."]
    pub seek: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: ::std::os::raw::c_int,
        ) -> Sint64,
    >,
    #[doc = "  Read up to \\c maxnum objects each of size \\c size from the data"]
    #[doc = "  stream to the area pointed at by \\c ptr."]
    #[doc = ""]
    #[doc = "  \\return the number of objects read, or 0 at error or end of file."]
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut ::std::os::raw::c_void,
            size: size_t,
            maxnum: size_t,
        ) -> size_t,
    >,
    #[doc = "  Write exactly \\c num objects each of size \\c size from the area"]
    #[doc = "  pointed at by \\c ptr to data stream."]
    #[doc = ""]
    #[doc = "  \\return the number of objects written, or 0 at error or end of file."]
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const ::std::os::raw::c_void,
            size: size_t,
            num: size_t,
        ) -> size_t,
    >,
    #[doc = "  Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = "  \\return 0 if successful or -1 on write error when flushing data."]
    pub close: ::std::option::Option<
        unsafe extern "C" fn(context: *mut SDL_RWops) -> ::std::os::raw::c_int,
    >,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub stdio: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub autoclose: SDL_bool,
    pub fp: *mut FILE,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).autoclose as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(autoclose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).fp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).base as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).here as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).stop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(stop)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    pub data1: *mut ::std::os::raw::c_void,
    pub data2: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>())).data1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>())).data2 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data2)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).stdio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(stdio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).mem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops__bindgen_ty_1>())).unknown as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    assert_eq!(
        ::std::mem::size_of::<SDL_RWops>(),
        72usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_RWops>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).seek as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).close as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).type_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_RWops>())).hidden as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
extern "C" {
    pub fn SDL_RWFromFile(
        file: *const ::std::os::raw::c_char,
        mode: *const ::std::os::raw::c_char,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromFP(fp: *mut FILE, autoclose: SDL_bool) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromMem(
        mem: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromConstMem(
        mem: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    #[doc = " Use this macro to get the size of the data stream in an SDL_RWops."]
    #[doc = ""]
    #[doc = " \\param context the SDL_RWops to get the size of the data stream from"]
    #[doc = " \\returns the size of the data stream in the SDL_RWops on success, -1 if"]
    #[doc = "          unknown or a negative error code on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_RWsize(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = " Seek within an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " This function seeks to byte `offset`, relative to `whence`."]
    #[doc = ""]
    #[doc = " `whence` may be any of the following values:"]
    #[doc = ""]
    #[doc = " - `RW_SEEK_SET`: seek from the beginning of data"]
    #[doc = " - `RW_SEEK_CUR`: seek relative to current read point"]
    #[doc = " - `RW_SEEK_END`: seek relative to the end of data"]
    #[doc = ""]
    #[doc = " If this stream can not seek, it will return -1."]
    #[doc = ""]
    #[doc = " SDL_RWseek() is actually a wrapper function that calls the SDL_RWops's"]
    #[doc = " `seek` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param offset an offset in bytes, relative to **whence** location; can be"]
    #[doc = "               negative"]
    #[doc = " \\param whence any of `RW_SEEK_SET`, `RW_SEEK_CUR`, `RW_SEEK_END`"]
    #[doc = " \\returns the final offset in the data stream after the seek or -1 on error."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWtell"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWseek(
        context: *mut SDL_RWops,
        offset: Sint64,
        whence: ::std::os::raw::c_int,
    ) -> Sint64;
}
extern "C" {
    #[doc = " Determine the current read/write offset in an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " SDL_RWtell is actually a wrapper function that calls the SDL_RWops's `seek`"]
    #[doc = " method, with an offset of 0 bytes from `RW_SEEK_CUR`, to simplify"]
    #[doc = " application development."]
    #[doc = ""]
    #[doc = " \\param context a SDL_RWops data stream object from which to get the current"]
    #[doc = "                offset"]
    #[doc = " \\returns the current offset in the stream, or -1 if the information can not"]
    #[doc = "          be determined."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWtell(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    #[doc = " Read from a data source."]
    #[doc = ""]
    #[doc = " This function reads up to `maxnum` objects each of size `size` from the"]
    #[doc = " data source to the area pointed at by `ptr`. This function may read less"]
    #[doc = " objects than requested. It will return zero when there has been an error or"]
    #[doc = " the data stream is completely read."]
    #[doc = ""]
    #[doc = " SDL_RWread() is actually a function wrapper that calls the SDL_RWops's"]
    #[doc = " `read` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param ptr a pointer to a buffer to read data into"]
    #[doc = " \\param size the size of each object to read, in bytes"]
    #[doc = " \\param maxnum the maximum number of objects to be read"]
    #[doc = " \\returns the number of objects read, or 0 at error or end of file; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWread(
        context: *mut SDL_RWops,
        ptr: *mut ::std::os::raw::c_void,
        size: size_t,
        maxnum: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " Write to an SDL_RWops data stream."]
    #[doc = ""]
    #[doc = " This function writes exactly `num` objects each of size `size` from the"]
    #[doc = " area pointed at by `ptr` to the stream. If this fails for any reason, it'll"]
    #[doc = " return less than `num` to demonstrate how far the write progressed. On"]
    #[doc = " success, it returns `num`."]
    #[doc = ""]
    #[doc = " SDL_RWwrite is actually a function wrapper that calls the SDL_RWops's"]
    #[doc = " `write` method appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " \\param context a pointer to an SDL_RWops structure"]
    #[doc = " \\param ptr a pointer to a buffer containing data to write"]
    #[doc = " \\param size the size of an object to write, in bytes"]
    #[doc = " \\param num the number of objects to write"]
    #[doc = " \\returns the number of objects written, which will be less than **num** on"]
    #[doc = "          error; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWclose"]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    pub fn SDL_RWwrite(
        context: *mut SDL_RWops,
        ptr: *const ::std::os::raw::c_void,
        size: size_t,
        num: size_t,
    ) -> size_t;
}
extern "C" {
    #[doc = " Close and free an allocated SDL_RWops structure."]
    #[doc = ""]
    #[doc = " SDL_RWclose() closes and cleans up the SDL_RWops stream. It releases any"]
    #[doc = " resources used by the stream and frees the SDL_RWops itself with"]
    #[doc = " SDL_FreeRW(). This returns 0 on success, or -1 if the stream failed to"]
    #[doc = " flush to its output (e.g. to disk)."]
    #[doc = ""]
    #[doc = " Note that if this fails to flush the stream to disk, this function reports"]
    #[doc = " an error, but the SDL_RWops is still invalid once this function returns."]
    #[doc = ""]
    #[doc = " SDL_RWclose() is actually a macro that calls the SDL_RWops's `close` method"]
    #[doc = " appropriately, to simplify application development."]
    #[doc = ""]
    #[doc = " \\param context SDL_RWops structure to close"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_RWFromConstMem"]
    #[doc = " \\sa SDL_RWFromFile"]
    #[doc = " \\sa SDL_RWFromFP"]
    #[doc = " \\sa SDL_RWFromMem"]
    #[doc = " \\sa SDL_RWread"]
    #[doc = " \\sa SDL_RWseek"]
    #[doc = " \\sa SDL_RWwrite"]
    pub fn SDL_RWclose(context: *mut SDL_RWops) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Load all the data from an SDL data stream."]
    #[doc = ""]
    #[doc = " The data is allocated with a zero byte at the end (null terminated) for"]
    #[doc = " convenience. This extra byte is not included in the value reported via"]
    #[doc = " `datasize`."]
    #[doc = ""]
    #[doc = " The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " \\param src the SDL_RWops to read all available data from"]
    #[doc = " \\param datasize if not NULL, will store the number of bytes read"]
    #[doc = " \\param freesrc if non-zero, calls SDL_RWclose() on `src` before returning"]
    #[doc = " \\returns the data, or NULL if there was an error."]
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut size_t,
        freesrc: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Load all the data from a file path."]
    #[doc = ""]
    #[doc = " The data is allocated with a zero byte at the end (null terminated) for"]
    #[doc = " convenience. This extra byte is not included in the value reported via"]
    #[doc = " `datasize`."]
    #[doc = ""]
    #[doc = " The data should be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " \\param file the path to read all available data from"]
    #[doc = " \\param datasize if not NULL, will store the number of bytes read"]
    #[doc = " \\returns the data, or NULL if there was an error."]
    pub fn SDL_LoadFile(
        file: *const ::std::os::raw::c_char,
        datasize: *mut size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
extern "C" {
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
#[doc = "  \\brief Audio format flags."]
#[doc = ""]
#[doc = "  These are what the 16 bits in SDL_AudioFormat currently mean..."]
#[doc = "  (Unspecified bits are always zero)."]
#[doc = ""]
#[doc = "  \\verbatim"]
#[doc = "++-----------------------sample is signed if set"]
#[doc = "||"]
#[doc = "||       ++-----------sample is bigendian if set"]
#[doc = "||       ||"]
#[doc = "||       ||          ++---sample is float if set"]
#[doc = "||       ||          ||"]
#[doc = "||       ||          || +---sample bit size---+"]
#[doc = "||       ||          || |                     |"]
#[doc = "15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00"]
#[doc = "\\endverbatim"]
#[doc = ""]
#[doc = "  There are macros in SDL 2.0 and later to query these bits."]
pub type SDL_AudioFormat = Uint16;
#[doc = "  This function is called when the audio device needs more data."]
#[doc = ""]
#[doc = "  \\param userdata An application-specific parameter saved in"]
#[doc = "                  the SDL_AudioSpec structure"]
#[doc = "  \\param stream A pointer to the audio data buffer."]
#[doc = "  \\param len    The length of that buffer in bytes."]
#[doc = ""]
#[doc = "  Once the callback returns, the buffer will no longer be valid."]
#[doc = "  Stereo samples are stored in a LRLRLR ordering."]
#[doc = ""]
#[doc = "  You can choose to avoid callbacks and use SDL_QueueAudio() instead, if"]
#[doc = "  you like. Just open your audio device with a NULL callback."]
pub type SDL_AudioCallback = ::std::option::Option<
    unsafe extern "C" fn(
        userdata: *mut ::std::os::raw::c_void,
        stream: *mut Uint8,
        len: ::std::os::raw::c_int,
    ),
>;
#[doc = "  The calculated values in this structure are calculated by SDL_OpenAudio()."]
#[doc = ""]
#[doc = "  For multi-channel audio, the default SDL channel mapping is:"]
#[doc = "  2:  FL FR                       (stereo)"]
#[doc = "  3:  FL FR LFE                   (2.1 surround)"]
#[doc = "  4:  FL FR BL BR                 (quad)"]
#[doc = "  5:  FL FR FC BL BR              (quad + center)"]
#[doc = "  6:  FL FR FC LFE SL SR          (5.1 surround - last two can also be BL BR)"]
#[doc = "  7:  FL FR FC LFE BC SL SR       (6.1 surround)"]
#[doc = "  8:  FL FR FC LFE BL BR SL SR    (7.1 surround)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioSpec {
    #[doc = "< DSP frequency -- samples per second"]
    pub freq: ::std::os::raw::c_int,
    #[doc = "< Audio data format"]
    pub format: SDL_AudioFormat,
    #[doc = "< Number of channels: 1 mono, 2 stereo"]
    pub channels: Uint8,
    #[doc = "< Audio buffer silence value (calculated)"]
    pub silence: Uint8,
    #[doc = "< Audio buffer size in sample FRAMES (total samples divided by channel count)"]
    pub samples: Uint16,
    #[doc = "< Necessary for some compile environments"]
    pub padding: Uint16,
    #[doc = "< Audio buffer size in bytes (calculated)"]
    pub size: Uint32,
    #[doc = "< Callback that feeds the audio device (NULL to use SDL_QueueAudio())."]
    pub callback: SDL_AudioCallback,
    #[doc = "< Userdata passed to callback (ignored for NULL callbacks)."]
    pub userdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    assert_eq!(
        ::std::mem::size_of::<SDL_AudioSpec>(),
        32usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_AudioSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).freq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).channels as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).silence as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).samples as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).padding as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioSpec>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
pub type SDL_AudioFilter =
    ::std::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AudioCVT {
    #[doc = "< Set to 1 if conversion possible"]
    pub needed: ::std::os::raw::c_int,
    #[doc = "< Source audio format"]
    pub src_format: SDL_AudioFormat,
    #[doc = "< Target audio format"]
    pub dst_format: SDL_AudioFormat,
    #[doc = "< Rate conversion increment"]
    pub rate_incr: f64,
    #[doc = "< Buffer to hold entire audio data"]
    pub buf: *mut Uint8,
    #[doc = "< Length of original audio buffer"]
    pub len: ::std::os::raw::c_int,
    #[doc = "< Length of converted audio buffer"]
    pub len_cvt: ::std::os::raw::c_int,
    #[doc = "< buffer must be len*len_mult big"]
    pub len_mult: ::std::os::raw::c_int,
    #[doc = "< Given len, final size is len*len_ratio"]
    pub len_ratio: f64,
    #[doc = "< NULL-terminated list of filter functions"]
    pub filters: [SDL_AudioFilter; 10usize],
    #[doc = "< Current audio conversion function"]
    pub filter_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    assert_eq!(
        ::std::mem::size_of::<SDL_AudioCVT>(),
        128usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_AudioCVT>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).needed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).src_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).dst_format as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).rate_incr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_cvt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_mult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).len_ratio as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).filters as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_AudioCVT>())).filter_index as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
extern "C" {
    pub fn SDL_GetNumAudioDrivers() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_GetAudioDriver(index: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn SDL_AudioInit(driver_name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SDL_AudioQuit();
}
extern "C" {
    #[doc = " Get the name of the current audio driver."]
    #[doc = ""]
    #[doc = " The returned string points to internal static memory and thus never becomes"]
    #[doc = " invalid, even if you quit the audio subsystem and initialize a new driver"]
    #[doc = " (although such a case would return a different static string from another"]
    #[doc = " call to this function, of course). As such, you should not modify or free"]
    #[doc = " the returned string."]
    #[doc = ""]
    #[doc = " \\returns the name of the current audio driver or NULL if no driver has been"]
    #[doc = "          initialized."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioInit"]
    pub fn SDL_GetCurrentAudioDriver() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " This function is a legacy means of opening the audio device."]
    #[doc = ""]
    #[doc = " This function remains for compatibility with SDL 1.2, but also because it's"]
    #[doc = " slightly easier to use than the new functions in SDL 2.0. The new, more"]
    #[doc = " powerful, and preferred way to do this is SDL_OpenAudioDevice()."]
    #[doc = ""]
    #[doc = " This function is roughly equivalent to:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_OpenAudioDevice(NULL, 0, desired, obtained, SDL_AUDIO_ALLOW_ANY_CHANGE);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " With two notable exceptions:"]
    #[doc = ""]
    #[doc = " - If `obtained` is NULL, we use `desired` (and allow no changes), which"]
    #[doc = "   means desired will be modified to have the correct values for silence,"]
    #[doc = "   etc, and SDL will convert any differences between your app's specific"]
    #[doc = "   request and the hardware behind the scenes."]
    #[doc = " - The return value is always success or failure, and not a device ID, which"]
    #[doc = "   means you can only have one device open at a time with this function."]
    #[doc = ""]
    #[doc = " \\param desired an SDL_AudioSpec structure representing the desired output"]
    #[doc = "                format. Please refer to the SDL_OpenAudioDevice"]
    #[doc = "                documentation for details on how to prepare this structure."]
    #[doc = " \\param obtained an SDL_AudioSpec structure filled in with the actual"]
    #[doc = "                 parameters, or NULL."]
    #[doc = " \\returns 0 if successful, placing the actual hardware parameters in the"]
    #[doc = "          structure pointed to by `obtained`."]
    #[doc = ""]
    #[doc = "          If `obtained` is NULL, the audio data passed to the callback"]
    #[doc = "          function will be guaranteed to be in the requested format, and"]
    #[doc = "          will be automatically converted to the actual hardware audio"]
    #[doc = "          format if necessary. If `obtained` is NULL, `desired` will have"]
    #[doc = "          fields modified."]
    #[doc = ""]
    #[doc = "          This function returns a negative error code on failure to open the"]
    #[doc = "          audio device or failure to set up the audio thread; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CloseAudio"]
    #[doc = " \\sa SDL_LockAudio"]
    #[doc = " \\sa SDL_PauseAudio"]
    #[doc = " \\sa SDL_UnlockAudio"]
    pub fn SDL_OpenAudio(
        desired: *mut SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
    ) -> ::std::os::raw::c_int;
}
#[doc = "  SDL Audio Device IDs."]
#[doc = ""]
#[doc = "  A successful call to SDL_OpenAudio() is always device id 1, and legacy"]
#[doc = "  SDL audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls"]
#[doc = "  always returns devices >= 2 on success. The legacy calls are good both"]
#[doc = "  for backwards compatibility and when you don't care about multiple,"]
#[doc = "  specific, or capture devices."]
pub type SDL_AudioDeviceID = Uint32;
extern "C" {
    #[doc = " Get the number of built-in audio devices."]
    #[doc = ""]
    #[doc = " This function is only valid after successfully initializing the audio"]
    #[doc = " subsystem."]
    #[doc = ""]
    #[doc = " Note that audio capture support is not implemented as of SDL 2.0.4, so the"]
    #[doc = " `iscapture` parameter is for future expansion and should always be zero for"]
    #[doc = " now."]
    #[doc = ""]
    #[doc = " This function will return -1 if an explicit list of devices can't be"]
    #[doc = " determined. Returning -1 is not an error. For example, if SDL is set up to"]
    #[doc = " talk to a remote audio server, it can't list every one available on the"]
    #[doc = " Internet, but it will still allow a specific host to be specified in"]
    #[doc = " SDL_OpenAudioDevice()."]
    #[doc = ""]
    #[doc = " In many common cases, when this function returns a value <= 0, it can still"]
    #[doc = " successfully open the default device (NULL for first argument of"]
    #[doc = " SDL_OpenAudioDevice())."]
    #[doc = ""]
    #[doc = " This function may trigger a complete redetect of available hardware. It"]
    #[doc = " should not be called for each iteration of a loop, but rather once at the"]
    #[doc = " start of a loop:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " // Don't do this:"]
    #[doc = " for (int i = 0; i < SDL_GetNumAudioDevices(0); i++)"]
    #[doc = ""]
    #[doc = " // do this instead:"]
    #[doc = " const int count = SDL_GetNumAudioDevices(0);"]
    #[doc = " for (int i = 0; i < count; ++i) { do_something_here(); }"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param iscapture zero to request playback devices, non-zero to request"]
    #[doc = "                  recording devices"]
    #[doc = " \\returns the number of available devices exposed by the current driver or"]
    #[doc = "          -1 if an explicit list of devices can't be determined. A return"]
    #[doc = "          value of -1 does not necessarily mean an error condition."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetAudioDeviceName"]
    #[doc = " \\sa SDL_OpenAudioDevice"]
    pub fn SDL_GetNumAudioDevices(iscapture: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the human-readable name of a specific audio device."]
    #[doc = ""]
    #[doc = " This function is only valid after successfully initializing the audio"]
    #[doc = " subsystem. The values returned by this function reflect the latest call to"]
    #[doc = " SDL_GetNumAudioDevices(); re-call that function to redetect available"]
    #[doc = " hardware."]
    #[doc = ""]
    #[doc = " The string returned by this function is UTF-8 encoded, read-only, and"]
    #[doc = " managed internally. You are not to free it. If you need to keep the string"]
    #[doc = " for any length of time, you should make your own copy of it, as it will be"]
    #[doc = " invalid next time any of several other SDL functions are called."]
    #[doc = ""]
    #[doc = " \\param index the index of the audio device; valid values range from 0 to"]
    #[doc = "              SDL_GetNumAudioDevices() - 1"]
    #[doc = " \\param iscapture non-zero to query the list of recording devices, zero to"]
    #[doc = "                  query the list of output devices."]
    #[doc = " \\returns the name of the audio device at the requested index, or NULL on"]
    #[doc = "          error."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumAudioDevices"]
    pub fn SDL_GetAudioDeviceName(
        index: ::std::os::raw::c_int,
        iscapture: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the preferred audio format of a specific audio device."]
    #[doc = ""]
    #[doc = " This function is only valid after a successfully initializing the audio"]
    #[doc = " subsystem. The values returned by this function reflect the latest call to"]
    #[doc = " SDL_GetNumAudioDevices(); re-call that function to redetect available"]
    #[doc = " hardware."]
    #[doc = ""]
    #[doc = " `spec` will be filled with the sample rate, sample format, and channel"]
    #[doc = " count. All other values in the structure are filled with 0. When the"]
    #[doc = " supported struct members are 0, SDL was unable to get the property from the"]
    #[doc = " backend."]
    #[doc = ""]
    #[doc = " \\param index the index of the audio device; valid values range from 0 to"]
    #[doc = "              SDL_GetNumAudioDevices() - 1"]
    #[doc = " \\param iscapture non-zero to query the list of recording devices, zero to"]
    #[doc = "                  query the list of output devices."]
    #[doc = " \\param spec The SDL_AudioSpec to be initialized by this function."]
    #[doc = " \\returns 0 on success, nonzero on error"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumAudioDevices"]
    pub fn SDL_GetAudioDeviceSpec(
        index: ::std::os::raw::c_int,
        iscapture: ::std::os::raw::c_int,
        spec: *mut SDL_AudioSpec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Open a specific audio device."]
    #[doc = ""]
    #[doc = " SDL_OpenAudio(), unlike this function, always acts on device ID 1. As such,"]
    #[doc = " this function will never return a 1 so as not to conflict with the legacy"]
    #[doc = " function."]
    #[doc = ""]
    #[doc = " Please note that SDL 2.0 before 2.0.5 did not support recording; as such,"]
    #[doc = " this function would fail if `iscapture` was not zero. Starting with SDL"]
    #[doc = " 2.0.5, recording is implemented and this value can be non-zero."]
    #[doc = ""]
    #[doc = " Passing in a `device` name of NULL requests the most reasonable default"]
    #[doc = " (and is equivalent to what SDL_OpenAudio() does to choose a device). The"]
    #[doc = " `device` name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but"]
    #[doc = " some drivers allow arbitrary and driver-specific strings, such as a"]
    #[doc = " hostname/IP address for a remote audio server, or a filename in the"]
    #[doc = " diskaudio driver."]
    #[doc = ""]
    #[doc = " When filling in the desired audio spec structure:"]
    #[doc = ""]
    #[doc = " - `desired->freq` should be the frequency in sample-frames-per-second (Hz)."]
    #[doc = " - `desired->format` should be the audio format (`AUDIO_S16SYS`, etc)."]
    #[doc = " - `desired->samples` is the desired size of the audio buffer, in _sample"]
    #[doc = "   frames_ (with stereo output, two samples--left and right--would make a"]
    #[doc = "   single sample frame). This number should be a power of two, and may be"]
    #[doc = "   adjusted by the audio driver to a value more suitable for the hardware."]
    #[doc = "   Good values seem to range between 512 and 8096 inclusive, depending on"]
    #[doc = "   the application and CPU speed. Smaller values reduce latency, but can"]
    #[doc = "   lead to underflow if the application is doing heavy processing and cannot"]
    #[doc = "   fill the audio buffer in time. Note that the number of sample frames is"]
    #[doc = "   directly related to time by the following formula: `ms ="]
    #[doc = "   (sampleframes*1000)/freq`"]
    #[doc = " - `desired->size` is the size in _bytes_ of the audio buffer, and is"]
    #[doc = "   calculated by SDL_OpenAudioDevice(). You don't initialize this."]
    #[doc = " - `desired->silence` is the value used to set the buffer to silence, and is"]
    #[doc = "   calculated by SDL_OpenAudioDevice(). You don't initialize this."]
    #[doc = " - `desired->callback` should be set to a function that will be called when"]
    #[doc = "   the audio device is ready for more data. It is passed a pointer to the"]
    #[doc = "   audio buffer, and the length in bytes of the audio buffer. This function"]
    #[doc = "   usually runs in a separate thread, and so you should protect data"]
    #[doc = "   structures that it accesses by calling SDL_LockAudioDevice() and"]
    #[doc = "   SDL_UnlockAudioDevice() in your code. Alternately, you may pass a NULL"]
    #[doc = "   pointer here, and call SDL_QueueAudio() with some frequency, to queue"]
    #[doc = "   more audio samples to be played (or for capture devices, call"]
    #[doc = "   SDL_DequeueAudio() with some frequency, to obtain audio samples)."]
    #[doc = " - `desired->userdata` is passed as the first parameter to your callback"]
    #[doc = "   function. If you passed a NULL callback, this value is ignored."]
    #[doc = ""]
    #[doc = " `allowed_changes` can have the following flags OR'd together:"]
    #[doc = ""]
    #[doc = " - `SDL_AUDIO_ALLOW_FREQUENCY_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_FORMAT_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_CHANNELS_CHANGE`"]
    #[doc = " - `SDL_AUDIO_ALLOW_ANY_CHANGE`"]
    #[doc = ""]
    #[doc = " These flags specify how SDL should behave when a device cannot offer a"]
    #[doc = " specific feature. If the application requests a feature that the hardware"]
    #[doc = " doesn't offer, SDL will always try to get the closest equivalent."]
    #[doc = ""]
    #[doc = " For example, if you ask for float32 audio format, but the sound card only"]
    #[doc = " supports int16, SDL will set the hardware to int16. If you had set"]
    #[doc = " SDL_AUDIO_ALLOW_FORMAT_CHANGE, SDL will change the format in the `obtained`"]
    #[doc = " structure. If that flag was *not* set, SDL will prepare to convert your"]
    #[doc = " callback's float32 audio to int16 before feeding it to the hardware and"]
    #[doc = " will keep the originally requested format in the `obtained` structure."]
    #[doc = ""]
    #[doc = " If your application can only handle one specific data format, pass a zero"]
    #[doc = " for `allowed_changes` and let SDL transparently handle any differences."]
    #[doc = ""]
    #[doc = " An opened audio device starts out paused, and should be enabled for playing"]
    #[doc = " by calling SDL_PauseAudioDevice(devid, 0) when you are ready for your audio"]
    #[doc = " callback function to be called. Since the audio driver may modify the"]
    #[doc = " requested size of the audio buffer, you should allocate any local mixing"]
    #[doc = " buffers after you open the audio device."]
    #[doc = ""]
    #[doc = " The audio callback runs in a separate thread in most cases; you can prevent"]
    #[doc = " race conditions between your callback and other threads without fully"]
    #[doc = " pausing playback with SDL_LockAudioDevice(). For more information about the"]
    #[doc = " callback, see SDL_AudioSpec."]
    #[doc = ""]
    #[doc = " \\param device a UTF-8 string reported by SDL_GetAudioDeviceName() or a"]
    #[doc = "               driver-specific name as appropriate. NULL requests the most"]
    #[doc = "               reasonable default device."]
    #[doc = " \\param iscapture non-zero to specify a device should be opened for"]
    #[doc = "                  recording, not playback"]
    #[doc = " \\param desired an SDL_AudioSpec structure representing the desired output"]
    #[doc = "                format; see SDL_OpenAudio() for more information"]
    #[doc = " \\param obtained an SDL_AudioSpec structure filled in with the actual output"]
    #[doc = "                 format; see SDL_OpenAudio() for more information"]
    #[doc = " \\param allowed_changes 0, or one or more flags OR'd together"]
    #[doc = " \\returns a valid device ID that is > 0 on success or 0 on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = "          For compatibility with SDL 1.2, this will never return 1, since"]
    #[doc = "          SDL reserves that ID for the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CloseAudioDevice"]
    #[doc = " \\sa SDL_GetAudioDeviceName"]
    #[doc = " \\sa SDL_LockAudioDevice"]
    #[doc = " \\sa SDL_OpenAudio"]
    #[doc = " \\sa SDL_PauseAudioDevice"]
    #[doc = " \\sa SDL_UnlockAudioDevice"]
    pub fn SDL_OpenAudioDevice(
        device: *const ::std::os::raw::c_char,
        iscapture: ::std::os::raw::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: ::std::os::raw::c_int,
    ) -> SDL_AudioDeviceID;
}
pub const SDL_AudioStatus_SDL_AUDIO_STOPPED: SDL_AudioStatus = 0;
pub const SDL_AudioStatus_SDL_AUDIO_PLAYING: SDL_AudioStatus = 1;
pub const SDL_AudioStatus_SDL_AUDIO_PAUSED: SDL_AudioStatus = 2;
pub type SDL_AudioStatus = ::std::os::raw::c_uint;
extern "C" {
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_PauseAudio(pause_on: ::std::os::raw::c_int);
}
extern "C" {
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Load the audio data of a WAVE file into memory."]
    #[doc = ""]
    #[doc = " Loading a WAVE file requires `src`, `spec`, `audio_buf` and `audio_len` to"]
    #[doc = " be valid pointers. The entire data portion of the file is then loaded into"]
    #[doc = " memory and decoded if necessary."]
    #[doc = ""]
    #[doc = " If `freesrc` is non-zero, the data source gets automatically closed and"]
    #[doc = " freed before the function returns."]
    #[doc = ""]
    #[doc = " Supported formats are RIFF WAVE files with the formats PCM (8, 16, 24, and"]
    #[doc = " 32 bits), IEEE Float (32 bits), Microsoft ADPCM and IMA ADPCM (4 bits), and"]
    #[doc = " A-law and mu-law (8 bits). Other formats are currently unsupported and"]
    #[doc = " cause an error."]
    #[doc = ""]
    #[doc = " If this function succeeds, the pointer returned by it is equal to `spec`"]
    #[doc = " and the pointer to the audio data allocated by the function is written to"]
    #[doc = " `audio_buf` and its length in bytes to `audio_len`. The SDL_AudioSpec"]
    #[doc = " members `freq`, `channels`, and `format` are set to the values of the audio"]
    #[doc = " data in the buffer. The `samples` member is set to a sane default and all"]
    #[doc = " others are set to zero."]
    #[doc = ""]
    #[doc = " It's necessary to use SDL_FreeWAV() to free the audio data returned in"]
    #[doc = " `audio_buf` when it is no longer used."]
    #[doc = ""]
    #[doc = " Because of the underspecification of the .WAV format, there are many"]
    #[doc = " problematic files in the wild that cause issues with strict decoders. To"]
    #[doc = " provide compatibility with these files, this decoder is lenient in regards"]
    #[doc = " to the truncation of the file, the fact chunk, and the size of the RIFF"]
    #[doc = " chunk. The hints `SDL_HINT_WAVE_RIFF_CHUNK_SIZE`,"]
    #[doc = " `SDL_HINT_WAVE_TRUNCATION`, and `SDL_HINT_WAVE_FACT_CHUNK` can be used to"]
    #[doc = " tune the behavior of the loading process."]
    #[doc = ""]
    #[doc = " Any file that is invalid (due to truncation, corruption, or wrong values in"]
    #[doc = " the headers), too big, or unsupported causes an error. Additionally, any"]
    #[doc = " critical I/O error from the data source will terminate the loading process"]
    #[doc = " with an error. The function returns NULL on error and in all cases (with"]
    #[doc = " the exception of `src` being NULL), an appropriate error message will be"]
    #[doc = " set."]
    #[doc = ""]
    #[doc = " It is required that the data source supports seeking."]
    #[doc = ""]
    #[doc = " Example:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_LoadWAV_RW(SDL_RWFromFile(\"sample.wav\", \"rb\"), 1, &spec, &buf, &len);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " Note that the SDL_LoadWAV macro does this same thing for you, but in a less"]
    #[doc = " messy way:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_LoadWAV(\"sample.wav\", &spec, &buf, &len);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " \\param src The data source for the WAVE data"]
    #[doc = " \\param freesrc If non-zero, SDL will _always_ free the data source"]
    #[doc = " \\param spec An SDL_AudioSpec that will be filled in with the wave file's"]
    #[doc = "             format details"]
    #[doc = " \\param audio_buf A pointer filled with the audio data, allocated by the"]
    #[doc = "                  function."]
    #[doc = " \\param audio_len A pointer filled with the length of the audio data buffer"]
    #[doc = "                  in bytes"]
    #[doc = " \\returns This function, if successfully called, returns `spec`, which will"]
    #[doc = "          be filled with the audio data format of the wave source data."]
    #[doc = "          `audio_buf` will be filled with a pointer to an allocated buffer"]
    #[doc = "          containing the audio data, and `audio_len` is filled with the"]
    #[doc = "          length of that audio buffer in bytes."]
    #[doc = ""]
    #[doc = "          This function returns NULL if the .WAV file cannot be opened, uses"]
    #[doc = "          an unknown data format, or is corrupt; call SDL_GetError() for"]
    #[doc = "          more information."]
    #[doc = ""]
    #[doc = "          When the application is done with the data returned in"]
    #[doc = "          `audio_buf`, it should call SDL_FreeWAV() to dispose of it."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeWAV"]
    #[doc = " \\sa SDL_LoadWAV"]
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: ::std::os::raw::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    #[doc = " Free data previously allocated with SDL_LoadWAV() or SDL_LoadWAV_RW()."]
    #[doc = ""]
    #[doc = " After a WAVE file has been opened with SDL_LoadWAV() or SDL_LoadWAV_RW()"]
    #[doc = " its data can eventually be freed with SDL_FreeWAV(). It is safe to call"]
    #[doc = " this function with a NULL pointer."]
    #[doc = ""]
    #[doc = " \\param audio_buf a pointer to the buffer created by SDL_LoadWAV() or"]
    #[doc = "                  SDL_LoadWAV_RW()"]
    #[doc = ""]
    #[doc = " \\sa SDL_LoadWAV"]
    #[doc = " \\sa SDL_LoadWAV_RW"]
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    #[doc = " Initialize an SDL_AudioCVT structure for conversion."]
    #[doc = ""]
    #[doc = " Before an SDL_AudioCVT structure can be used to convert audio data it must"]
    #[doc = " be initialized with source and destination information."]
    #[doc = ""]
    #[doc = " This function will zero out every field of the SDL_AudioCVT, so it must be"]
    #[doc = " called before the application fills in the final buffer information."]
    #[doc = ""]
    #[doc = " Once this function has returned successfully, and reported that a"]
    #[doc = " conversion is necessary, the application fills in the rest of the fields in"]
    #[doc = " SDL_AudioCVT, now that it knows how large a buffer it needs to allocate,"]
    #[doc = " and then can call SDL_ConvertAudio() to complete the conversion."]
    #[doc = ""]
    #[doc = " \\param cvt an SDL_AudioCVT structure filled in with audio conversion"]
    #[doc = "            information"]
    #[doc = " \\param src_format the source format of the audio data; for more info see"]
    #[doc = "                   SDL_AudioFormat"]
    #[doc = " \\param src_channels the number of channels in the source"]
    #[doc = " \\param src_rate the frequency (sample-frames-per-second) of the source"]
    #[doc = " \\param dst_format the destination format of the audio data; for more info"]
    #[doc = "                   see SDL_AudioFormat"]
    #[doc = " \\param dst_channels the number of channels in the destination"]
    #[doc = " \\param dst_rate the frequency (sample-frames-per-second) of the destination"]
    #[doc = " \\returns 1 if the audio filter is prepared, 0 if no conversion is needed,"]
    #[doc = "          or a negative error code on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\sa SDL_ConvertAudio"]
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: ::std::os::raw::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Convert audio data to a desired audio format."]
    #[doc = ""]
    #[doc = " This function does the actual audio data conversion, after the application"]
    #[doc = " has called SDL_BuildAudioCVT() to prepare the conversion information and"]
    #[doc = " then filled in the buffer details."]
    #[doc = ""]
    #[doc = " Once the application has initialized the `cvt` structure using"]
    #[doc = " SDL_BuildAudioCVT(), allocated an audio buffer and filled it with audio"]
    #[doc = " data in the source format, this function will convert the buffer, in-place,"]
    #[doc = " to the desired format."]
    #[doc = ""]
    #[doc = " The data conversion may go through several passes; any given pass may"]
    #[doc = " possibly temporarily increase the size of the data. For example, SDL might"]
    #[doc = " expand 16-bit data to 32 bits before resampling to a lower frequency,"]
    #[doc = " shrinking the data size after having grown it briefly. Since the supplied"]
    #[doc = " buffer will be both the source and destination, converting as necessary"]
    #[doc = " in-place, the application must allocate a buffer that will fully contain"]
    #[doc = " the data during its largest conversion pass. After SDL_BuildAudioCVT()"]
    #[doc = " returns, the application should set the `cvt->len` field to the size, in"]
    #[doc = " bytes, of the source data, and allocate a buffer that is `cvt->len *"]
    #[doc = " cvt->len_mult` bytes long for the `buf` field."]
    #[doc = ""]
    #[doc = " The source data should be copied into this buffer before the call to"]
    #[doc = " SDL_ConvertAudio(). Upon successful return, this buffer will contain the"]
    #[doc = " converted audio, and `cvt->len_cvt` will be the size of the converted data,"]
    #[doc = " in bytes. Any bytes in the buffer past `cvt->len_cvt` are undefined once"]
    #[doc = " this function returns."]
    #[doc = ""]
    #[doc = " \\param cvt an SDL_AudioCVT structure that was previously set up by"]
    #[doc = "            SDL_BuildAudioCVT()."]
    #[doc = " \\returns 0 if the conversion was completed successfully or a negative error"]
    #[doc = "          code on failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BuildAudioCVT"]
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
extern "C" {
    #[doc = " Create a new audio stream."]
    #[doc = ""]
    #[doc = " \\param src_format The format of the source audio"]
    #[doc = " \\param src_channels The number of channels of the source audio"]
    #[doc = " \\param src_rate The sampling rate of the source audio"]
    #[doc = " \\param dst_format The format of the desired audio output"]
    #[doc = " \\param dst_channels The number of channels of the desired audio output"]
    #[doc = " \\param dst_rate The sampling rate of the desired audio output"]
    #[doc = " \\returns 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: ::std::os::raw::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: ::std::os::raw::c_int,
    ) -> *mut SDL_AudioStream;
}
extern "C" {
    #[doc = " Add data to be converted/resampled to the stream."]
    #[doc = ""]
    #[doc = " \\param stream The stream the audio data is being added to"]
    #[doc = " \\param buf A pointer to the audio data to add"]
    #[doc = " \\param len The number of bytes to write to the stream"]
    #[doc = " \\returns 0 on success, or -1 on error."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get converted/resampled data from the stream"]
    #[doc = ""]
    #[doc = " \\param stream The stream the audio is being requested from"]
    #[doc = " \\param buf A buffer to fill with audio data"]
    #[doc = " \\param len The maximum number of bytes to fill"]
    #[doc = " \\returns the number of bytes read from the stream, or -1 on error"]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the number of converted/resampled bytes available."]
    #[doc = ""]
    #[doc = " The stream may be buffering data behind the scenes until it has enough to"]
    #[doc = " resample correctly, so this number might be lower than what you expect, or"]
    #[doc = " even be zero. Add more data or flush the stream if you need the data now."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Tell the stream that you're done sending data, and anything being buffered"]
    #[doc = " should be converted/resampled and made available immediately."]
    #[doc = ""]
    #[doc = " It is legal to add more data to a stream after flushing, but there will be"]
    #[doc = " audio gaps in the output. Generally this is intended to signal the end of"]
    #[doc = " input, so the complete output becomes available."]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Clear any pending data in the stream without converting it"]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_FreeAudioStream"]
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " Free an audio stream"]
    #[doc = ""]
    #[doc = " \\sa SDL_NewAudioStream"]
    #[doc = " \\sa SDL_AudioStreamPut"]
    #[doc = " \\sa SDL_AudioStreamGet"]
    #[doc = " \\sa SDL_AudioStreamAvailable"]
    #[doc = " \\sa SDL_AudioStreamFlush"]
    #[doc = " \\sa SDL_AudioStreamClear"]
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
extern "C" {
    #[doc = " This function is a legacy means of mixing audio."]
    #[doc = ""]
    #[doc = " This function is equivalent to calling"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_MixAudioFormat(dst, src, format, len, volume);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " where `format` is the obtained format of the audio device from the legacy"]
    #[doc = " SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\param dst the destination for the mixed audio"]
    #[doc = " \\param src the source audio buffer to be mixed"]
    #[doc = " \\param len the length of the audio buffer in bytes"]
    #[doc = " \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME"]
    #[doc = "               for full audio volume"]
    #[doc = ""]
    #[doc = " \\sa SDL_MixAudioFormat"]
    pub fn SDL_MixAudio(
        dst: *mut Uint8,
        src: *const Uint8,
        len: Uint32,
        volume: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Mix audio data in a specified format."]
    #[doc = ""]
    #[doc = " This takes an audio buffer `src` of `len` bytes of `format` data and mixes"]
    #[doc = " it into `dst`, performing addition, volume adjustment, and overflow"]
    #[doc = " clipping. The buffer pointed to by `dst` must also be `len` bytes of"]
    #[doc = " `format` data."]
    #[doc = ""]
    #[doc = " This is provided for convenience -- you can mix your own audio data."]
    #[doc = ""]
    #[doc = " Do not use this function for mixing together more than two streams of"]
    #[doc = " sample data. The output from repeated application of this function may be"]
    #[doc = " distorted by clipping, because there is no accumulator with greater range"]
    #[doc = " than the input (not to mention this being an inefficient way of doing it)."]
    #[doc = ""]
    #[doc = " It is a common misconception that this function is required to write audio"]
    #[doc = " data to an output stream in an audio callback. While you can do that,"]
    #[doc = " SDL_MixAudioFormat() is really only needed when you're mixing a single"]
    #[doc = " audio stream with a volume adjustment."]
    #[doc = ""]
    #[doc = " \\param dst the destination for the mixed audio"]
    #[doc = " \\param src the source audio buffer to be mixed"]
    #[doc = " \\param format the SDL_AudioFormat structure representing the desired audio"]
    #[doc = "               format"]
    #[doc = " \\param len the length of the audio buffer in bytes"]
    #[doc = " \\param volume ranges from 0 - 128, and should be set to SDL_MIX_MAXVOLUME"]
    #[doc = "               for full audio volume"]
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Queue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = " If you are looking to retrieve queued audio from a non-callback capture"]
    #[doc = " device, you want SDL_DequeueAudio() instead. SDL_QueueAudio() will return"]
    #[doc = " -1 to signify an error if you use it with capture devices."]
    #[doc = ""]
    #[doc = " SDL offers two ways to feed audio to the device: you can either supply a"]
    #[doc = " callback that SDL triggers with some frequency to obtain more audio (pull"]
    #[doc = " method), or you can supply no callback, and then SDL will expect you to"]
    #[doc = " supply data at regular intervals (push method) with this function."]
    #[doc = ""]
    #[doc = " There are no limits on the amount of data you can queue, short of"]
    #[doc = " exhaustion of address space. Queued data will drain to the device as"]
    #[doc = " necessary without further intervention from you. If the device needs audio"]
    #[doc = " but there is not enough queued, it will play silence to make up the"]
    #[doc = " difference. This means you will have skips in your audio playback if you"]
    #[doc = " aren't routinely queueing sufficient data."]
    #[doc = ""]
    #[doc = " This function copies the supplied data, so you are safe to free it when the"]
    #[doc = " function returns. This function is thread-safe, but queueing to the same"]
    #[doc = " device from two threads at once does not promise which buffer will be"]
    #[doc = " queued first."]
    #[doc = ""]
    #[doc = " You may not queue audio on a device that is using an application-supplied"]
    #[doc = " callback; doing so returns an error. You have to use the audio callback or"]
    #[doc = " queue audio with this function, but not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before queueing; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " Note that SDL2"]
    #[doc = " [https://discourse.libsdl.org/t/sdl2-support-for-planar-audio/31263/3 does"]
    #[doc = " not support planar audio]. You will need to resample from planar audio"]
    #[doc = " formats into a non-planar one (see SDL_AudioFormat) before queuing audio."]
    #[doc = ""]
    #[doc = " \\param dev the device ID to which we will queue audio"]
    #[doc = " \\param data the data to queue to the device for later playback"]
    #[doc = " \\param len the number of bytes (not samples!) to which `data` points"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const ::std::os::raw::c_void,
        len: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Dequeue more audio on non-callback devices."]
    #[doc = ""]
    #[doc = " If you are looking to queue audio for output on a non-callback playback"]
    #[doc = " device, you want SDL_QueueAudio() instead. SDL_DequeueAudio() will always"]
    #[doc = " return 0 if you use it with playback devices."]
    #[doc = ""]
    #[doc = " SDL offers two ways to retrieve audio from a capture device: you can either"]
    #[doc = " supply a callback that SDL triggers with some frequency as the device"]
    #[doc = " records more audio data, (push method), or you can supply no callback, and"]
    #[doc = " then SDL will expect you to retrieve data at regular intervals (pull"]
    #[doc = " method) with this function."]
    #[doc = ""]
    #[doc = " There are no limits on the amount of data you can queue, short of"]
    #[doc = " exhaustion of address space. Data from the device will keep queuing as"]
    #[doc = " necessary without further intervention from you. This means you will"]
    #[doc = " eventually run out of memory if you aren't routinely dequeueing data."]
    #[doc = ""]
    #[doc = " Capture devices will not queue data when paused; if you are expecting to"]
    #[doc = " not need captured audio for some length of time, use SDL_PauseAudioDevice()"]
    #[doc = " to stop the capture device from queueing more data. This can be useful"]
    #[doc = " during, say, level loading times. When unpaused, capture devices will start"]
    #[doc = " queueing data from that point, having flushed any capturable data available"]
    #[doc = " while paused."]
    #[doc = ""]
    #[doc = " This function is thread-safe, but dequeueing from the same device from two"]
    #[doc = " threads at once does not promise which thread will dequeue data first."]
    #[doc = ""]
    #[doc = " You may not dequeue audio from a device that is using an"]
    #[doc = " application-supplied callback; doing so returns an error. You have to use"]
    #[doc = " the audio callback, or dequeue audio with this function, but not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before dequeueing; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " \\param dev the device ID from which we will dequeue audio"]
    #[doc = " \\param data a pointer into where audio data should be copied"]
    #[doc = " \\param len the number of bytes (not samples!) to which (data) points"]
    #[doc = " \\returns the number of bytes dequeued, which could be less than requested;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.5."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    pub fn SDL_DequeueAudio(
        dev: SDL_AudioDeviceID,
        data: *mut ::std::os::raw::c_void,
        len: Uint32,
    ) -> Uint32;
}
extern "C" {
    #[doc = " Get the number of bytes of still-queued audio."]
    #[doc = ""]
    #[doc = " For playback devices: this is the number of bytes that have been queued for"]
    #[doc = " playback with SDL_QueueAudio(), but have not yet been sent to the hardware."]
    #[doc = ""]
    #[doc = " Once we've sent it to the hardware, this function can not decide the exact"]
    #[doc = " byte boundary of what has been played. It's possible that we just gave the"]
    #[doc = " hardware several kilobytes right before you called this function, but it"]
    #[doc = " hasn't played any of it yet, or maybe half of it, etc."]
    #[doc = ""]
    #[doc = " For capture devices, this is the number of bytes that have been captured by"]
    #[doc = " the device and are waiting for you to dequeue. This number may grow at any"]
    #[doc = " time, so this only informs of the lower-bound of available data."]
    #[doc = ""]
    #[doc = " You may not queue or dequeue audio on a device that is using an"]
    #[doc = " application-supplied callback; calling this function on such a device"]
    #[doc = " always returns 0. You have to use the audio callback or queue audio, but"]
    #[doc = " not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before querying; SDL"]
    #[doc = " handles locking internally for this function."]
    #[doc = ""]
    #[doc = " \\param dev the device ID of which we will query queued audio size"]
    #[doc = " \\returns the number of bytes (not samples!) of queued audio."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_ClearQueuedAudio"]
    #[doc = " \\sa SDL_QueueAudio"]
    #[doc = " \\sa SDL_DequeueAudio"]
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
extern "C" {
    #[doc = " Drop any queued audio data waiting to be sent to the hardware."]
    #[doc = ""]
    #[doc = " Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For"]
    #[doc = " output devices, the hardware will start playing silence if more audio isn't"]
    #[doc = " queued. For capture devices, the hardware will start filling the empty"]
    #[doc = " queue with new data if the capture device isn't paused."]
    #[doc = ""]
    #[doc = " This will not prevent playback of queued audio that's already been sent to"]
    #[doc = " the hardware, as we can not undo that, so expect there to be some fraction"]
    #[doc = " of a second of audio that might still be heard. This can be useful if you"]
    #[doc = " want to, say, drop any pending music or any unprocessed microphone input"]
    #[doc = " during a level change in your game."]
    #[doc = ""]
    #[doc = " You may not queue or dequeue audio on a device that is using an"]
    #[doc = " application-supplied callback; calling this function on such a device"]
    #[doc = " always returns 0. You have to use the audio callback or queue audio, but"]
    #[doc = " not both."]
    #[doc = ""]
    #[doc = " You should not call SDL_LockAudio() on the device before clearing the"]
    #[doc = " queue; SDL handles locking internally for this function."]
    #[doc = ""]
    #[doc = " This function always succeeds and thus returns void."]
    #[doc = ""]
    #[doc = " \\param dev the device ID of which to clear the audio queue"]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetQueuedAudioSize"]
    #[doc = " \\sa SDL_QueueAudio"]
    #[doc = " \\sa SDL_DequeueAudio"]
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_LockAudio();
}
extern "C" {
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_UnlockAudio();
}
extern "C" {
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " This function is a legacy means of closing the audio device."]
    #[doc = ""]
    #[doc = " This function is equivalent to calling"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_CloseAudioDevice(1);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " and is only useful if you used the legacy SDL_OpenAudio() function."]
    #[doc = ""]
    #[doc = " \\sa SDL_OpenAudio"]
    pub fn SDL_CloseAudio();
}
extern "C" {
    #[doc = " Use this function to shut down audio processing and close the audio device."]
    #[doc = ""]
    #[doc = " The application should close open audio devices once they are no longer"]
    #[doc = " needed. Calling this function will wait until the device's audio callback"]
    #[doc = " is not running, release the audio hardware and then clean up internal"]
    #[doc = " state. No further audio will play from this device once this function"]
    #[doc = " returns."]
    #[doc = ""]
    #[doc = " This function may block briefly while pending audio data is played by the"]
    #[doc = " hardware, so that applications don't drop the last buffer of data they"]
    #[doc = " supplied."]
    #[doc = ""]
    #[doc = " The device ID is invalid as soon as the device is closed, and is eligible"]
    #[doc = " for reuse in a new SDL_OpenAudioDevice() call immediately."]
    #[doc = ""]
    #[doc = " \\param dev an audio device previously opened with SDL_OpenAudioDevice()"]
    #[doc = ""]
    #[doc = " \\sa SDL_OpenAudioDevice"]
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    #[doc = " Put UTF-8 text into the clipboard."]
    #[doc = ""]
    #[doc = " \\param text the text to store in the clipboard"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText"]
    #[doc = " \\sa SDL_HasClipboardText"]
    pub fn SDL_SetClipboardText(text: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get UTF-8 text from the clipboard, which must be freed with SDL_free()."]
    #[doc = ""]
    #[doc = " This functions returns NULL if there was not enough memory left for a copy"]
    #[doc = " of the clipboard's content."]
    #[doc = ""]
    #[doc = " \\returns the clipboard text on success or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information. Caller must call SDL_free()"]
    #[doc = "          on the returned pointer when done with it."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasClipboardText"]
    #[doc = " \\sa SDL_SetClipboardText"]
    pub fn SDL_GetClipboardText() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Query whether the clipboard exists and contains a non-empty text string."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the clipboard has text, or SDL_FALSE if it does not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetClipboardText"]
    #[doc = " \\sa SDL_SetClipboardText"]
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
extern "C" {
    #[doc = " Get the number of CPU cores available."]
    #[doc = ""]
    #[doc = " \\returns the total number of logical CPU cores. On CPUs that include"]
    #[doc = "          technologies such as hyperthreading, the number of logical cores"]
    #[doc = "          may be more than the number of physical cores."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCount() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Determine the L1 cache line size of the CPU."]
    #[doc = ""]
    #[doc = " This is useful for determining multi-threaded structure padding or SIMD"]
    #[doc = " prefetch sizes."]
    #[doc = ""]
    #[doc = " \\returns the L1 cache line size of the CPU, in bytes."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetCPUCacheLineSize() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Determine whether the CPU has the RDTSC instruction."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has the RDTSC instruction or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AltiVec features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using PowerPC instruction"]
    #[doc = " sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AltiVec features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has MMX features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has MMX features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has 3DNow! features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using AMD instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has 3DNow! features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE3 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE3 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE3() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE4.1 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE4.1 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasSSE41() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has SSE4.2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has SSE4.2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    pub fn SDL_HasSSE42() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.2."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX2"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX2 features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX2 features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_Has3DNow"]
    #[doc = " \\sa SDL_HasAltiVec"]
    #[doc = " \\sa SDL_HasAVX"]
    #[doc = " \\sa SDL_HasMMX"]
    #[doc = " \\sa SDL_HasRDTSC"]
    #[doc = " \\sa SDL_HasSSE"]
    #[doc = " \\sa SDL_HasSSE2"]
    #[doc = " \\sa SDL_HasSSE3"]
    #[doc = " \\sa SDL_HasSSE41"]
    #[doc = " \\sa SDL_HasSSE42"]
    pub fn SDL_HasAVX2() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has AVX-512F (foundation) features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using Intel instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has AVX-512F features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasAVX"]
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has ARM SIMD (ARMv6) features."]
    #[doc = ""]
    #[doc = " This is different from ARM NEON, which is a different instruction set."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using ARM instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has ARM SIMD features or SDL_FALSE if not."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasNEON"]
    pub fn SDL_HasARMSIMD() -> SDL_bool;
}
extern "C" {
    #[doc = " Determine whether the CPU has NEON (ARM SIMD) features."]
    #[doc = ""]
    #[doc = " This always returns false on CPUs that aren't using ARM instruction sets."]
    #[doc = ""]
    #[doc = " \\returns SDL_TRUE if the CPU has ARM NEON features or SDL_FALSE if not."]
    pub fn SDL_HasNEON() -> SDL_bool;
}
extern "C" {
    #[doc = " Get the amount of RAM configured in the system."]
    #[doc = ""]
    #[doc = " \\returns the amount of RAM configured in the system in MB."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.1."]
    pub fn SDL_GetSystemRAM() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Report the alignment this system needs for SIMD allocations."]
    #[doc = ""]
    #[doc = " This will return the minimum number of bytes to which a pointer must be"]
    #[doc = " aligned to be compatible with SIMD instructions on the current machine. For"]
    #[doc = " example, if the machine supports SSE only, it will return 16, but if it"]
    #[doc = " supports AVX-512F, it'll return 64 (etc). This only reports values for"]
    #[doc = " instruction sets SDL knows about, so if your SDL build doesn't have"]
    #[doc = " SDL_HasAVX512F(), then it might return 16 for the SSE support it sees and"]
    #[doc = " not 64 for the AVX-512 instructions that exist but SDL doesn't know about."]
    #[doc = " Plan accordingly."]
    #[doc = ""]
    #[doc = " \\returns the alignment in bytes needed for available, known SIMD"]
    #[doc = "          instructions."]
    pub fn SDL_SIMDGetAlignment() -> size_t;
}
extern "C" {
    #[doc = " Allocate memory in a SIMD-friendly way."]
    #[doc = ""]
    #[doc = " This will allocate a block of memory that is suitable for use with SIMD"]
    #[doc = " instructions. Specifically, it will be properly aligned and padded for the"]
    #[doc = " system's supported vector instructions."]
    #[doc = ""]
    #[doc = " The memory returned will be padded such that it is safe to read or write an"]
    #[doc = " incomplete vector at the end of the memory block. This can be useful so you"]
    #[doc = " don't have to drop back to a scalar fallback at the end of your SIMD"]
    #[doc = " processing loop to deal with the final elements without overflowing the"]
    #[doc = " allocated buffer."]
    #[doc = ""]
    #[doc = " You must free this memory with SDL_FreeSIMD(), not free() or SDL_free() or"]
    #[doc = " delete[], etc."]
    #[doc = ""]
    #[doc = " Note that SDL will only deal with SIMD instruction sets it is aware of; for"]
    #[doc = " example, SDL 2.0.8 knows that SSE wants 16-byte vectors (SDL_HasSSE()), and"]
    #[doc = " AVX2 wants 32 bytes (SDL_HasAVX2()), but doesn't know that AVX-512 wants"]
    #[doc = " 64. To be clear: if you can't decide to use an instruction set with an"]
    #[doc = " SDL_Has*() function, don't use that instruction set with memory allocated"]
    #[doc = " through here."]
    #[doc = ""]
    #[doc = " SDL_AllocSIMD(0) will return a non-NULL pointer, assuming the system isn't"]
    #[doc = " out of memory, but you are not allowed to dereference it (because you only"]
    #[doc = " own zero bytes of that buffer)."]
    #[doc = ""]
    #[doc = " \\param len The length, in bytes, of the block to allocate. The actual"]
    #[doc = "            allocated block might be larger due to padding, etc."]
    #[doc = " \\returns a pointer to thenewly-allocated block, NULL if out of memory."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlignment"]
    #[doc = " \\sa SDL_SIMDRealloc"]
    #[doc = " \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDAlloc(len: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Reallocate memory obtained from SDL_SIMDAlloc"]
    #[doc = ""]
    #[doc = " It is not valid to use this function on a pointer from anything but"]
    #[doc = " SDL_SIMDAlloc(). It can't be used on pointers from malloc, realloc,"]
    #[doc = " SDL_malloc, memalign, new[], etc."]
    #[doc = ""]
    #[doc = " \\param mem The pointer obtained from SDL_SIMDAlloc. This function also"]
    #[doc = "            accepts NULL, at which point this function is the same as"]
    #[doc = "            calling SDL_SIMDAlloc with a NULL pointer."]
    #[doc = " \\param len The length, in bytes, of the block to allocated. The actual"]
    #[doc = "            allocated block might be larger due to padding, etc. Passing 0"]
    #[doc = "            will return a non-NULL pointer, assuming the system isn't out of"]
    #[doc = "            memory."]
    #[doc = " \\returns a pointer to the newly-reallocated block, NULL if out of memory."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlignment"]
    #[doc = " \\sa SDL_SIMDAlloc"]
    #[doc = " \\sa SDL_SIMDFree"]
    pub fn SDL_SIMDRealloc(
        mem: *mut ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Deallocate memory obtained from SDL_SIMDAlloc"]
    #[doc = ""]
    #[doc = " It is not valid to use this function on a pointer from anything but"]
    #[doc = " SDL_SIMDAlloc() or SDL_SIMDRealloc(). It can't be used on pointers from"]
    #[doc = " malloc, realloc, SDL_malloc, memalign, new[], etc."]
    #[doc = ""]
    #[doc = " However, SDL_SIMDFree(NULL) is a legal no-op."]
    #[doc = ""]
    #[doc = " The memory pointed to by `ptr` is no longer valid for access upon return,"]
    #[doc = " and may be returned to the system or reused by a future allocation. The"]
    #[doc = " pointer passed to this function is no longer safe to dereference once this"]
    #[doc = " function returns, and should be discarded."]
    #[doc = ""]
    #[doc = " \\param ptr The pointer, returned from SDL_SIMDAlloc or SDL_SIMDRealloc, to"]
    #[doc = "            deallocate. NULL is a legal no-op."]
    #[doc = ""]
    #[doc = " \\sa SDL_SIMDAlloc"]
    #[doc = " \\sa SDL_SIMDRealloc"]
    pub fn SDL_SIMDFree(ptr: *mut ::std::os::raw::c_void);
}
pub const SDL_PixelType_SDL_PIXELTYPE_UNKNOWN: SDL_PixelType = 0;
pub const SDL_PixelType_SDL_PIXELTYPE_INDEX1: SDL_PixelType = 1;
pub const SDL_PixelType_SDL_PIXELTYPE_INDEX4: SDL_PixelType = 2;
pub const SDL_PixelType_SDL_PIXELTYPE_INDEX8: SDL_PixelType = 3;
pub const SDL_PixelType_SDL_PIXELTYPE_PACKED8: SDL_PixelType = 4;
pub const SDL_PixelType_SDL_PIXELTYPE_PACKED16: SDL_PixelType = 5;
pub const SDL_PixelType_SDL_PIXELTYPE_PACKED32: SDL_PixelType = 6;
pub const SDL_PixelType_SDL_PIXELTYPE_ARRAYU8: SDL_PixelType = 7;
pub const SDL_PixelType_SDL_PIXELTYPE_ARRAYU16: SDL_PixelType = 8;
pub const SDL_PixelType_SDL_PIXELTYPE_ARRAYU32: SDL_PixelType = 9;
pub const SDL_PixelType_SDL_PIXELTYPE_ARRAYF16: SDL_PixelType = 10;
pub const SDL_PixelType_SDL_PIXELTYPE_ARRAYF32: SDL_PixelType = 11;
#[doc = " Pixel type."]
pub type SDL_PixelType = ::std::os::raw::c_uint;
pub const SDL_BitmapOrder_SDL_BITMAPORDER_NONE: SDL_BitmapOrder = 0;
pub const SDL_BitmapOrder_SDL_BITMAPORDER_4321: SDL_BitmapOrder = 1;
pub const SDL_BitmapOrder_SDL_BITMAPORDER_1234: SDL_BitmapOrder = 2;
#[doc = " Bitmap pixel order, high bit -> low bit."]
pub type SDL_BitmapOrder = ::std::os::raw::c_uint;
pub const SDL_PackedOrder_SDL_PACKEDORDER_NONE: SDL_PackedOrder = 0;
pub const SDL_PackedOrder_SDL_PACKEDORDER_XRGB: SDL_PackedOrder = 1;
pub const SDL_PackedOrder_SDL_PACKEDORDER_RGBX: SDL_PackedOrder = 2;
pub const SDL_PackedOrder_SDL_PACKEDORDER_ARGB: SDL_PackedOrder = 3;
pub const SDL_PackedOrder_SDL_PACKEDORDER_RGBA: SDL_PackedOrder = 4;
pub const SDL_PackedOrder_SDL_PACKEDORDER_XBGR: SDL_PackedOrder = 5;
pub const SDL_PackedOrder_SDL_PACKEDORDER_BGRX: SDL_PackedOrder = 6;
pub const SDL_PackedOrder_SDL_PACKEDORDER_ABGR: SDL_PackedOrder = 7;
pub const SDL_PackedOrder_SDL_PACKEDORDER_BGRA: SDL_PackedOrder = 8;
#[doc = " Packed component order, high bit -> low bit."]
pub type SDL_PackedOrder = ::std::os::raw::c_uint;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_NONE: SDL_ArrayOrder = 0;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_RGB: SDL_ArrayOrder = 1;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_RGBA: SDL_ArrayOrder = 2;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_ARGB: SDL_ArrayOrder = 3;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_BGR: SDL_ArrayOrder = 4;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_BGRA: SDL_ArrayOrder = 5;
pub const SDL_ArrayOrder_SDL_ARRAYORDER_ABGR: SDL_ArrayOrder = 6;
#[doc = " Array component order, low byte -> high byte."]
pub type SDL_ArrayOrder = ::std::os::raw::c_uint;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_NONE: SDL_PackedLayout = 0;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_332: SDL_PackedLayout = 1;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_4444: SDL_PackedLayout = 2;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_1555: SDL_PackedLayout = 3;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_5551: SDL_PackedLayout = 4;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_565: SDL_PackedLayout = 5;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_8888: SDL_PackedLayout = 6;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_2101010: SDL_PackedLayout = 7;
pub const SDL_PackedLayout_SDL_PACKEDLAYOUT_1010102: SDL_PackedLayout = 8;
#[doc = " Packed component layout."]
pub type SDL_PackedLayout = ::std::os::raw::c_uint;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_UNKNOWN: SDL_PixelFormatEnum = 0;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX1LSB: SDL_PixelFormatEnum = 286261504;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX1MSB: SDL_PixelFormatEnum = 287310080;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX4LSB: SDL_PixelFormatEnum = 303039488;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX4MSB: SDL_PixelFormatEnum = 304088064;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_INDEX8: SDL_PixelFormatEnum = 318769153;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB332: SDL_PixelFormatEnum = 336660481;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XRGB4444: SDL_PixelFormatEnum = 353504258;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB444: SDL_PixelFormatEnum = 353504258;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XBGR4444: SDL_PixelFormatEnum = 357698562;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR444: SDL_PixelFormatEnum = 357698562;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XRGB1555: SDL_PixelFormatEnum = 353570562;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB555: SDL_PixelFormatEnum = 353570562;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XBGR1555: SDL_PixelFormatEnum = 357764866;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR555: SDL_PixelFormatEnum = 357764866;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB4444: SDL_PixelFormatEnum = 355602434;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA4444: SDL_PixelFormatEnum = 356651010;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR4444: SDL_PixelFormatEnum = 359796738;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA4444: SDL_PixelFormatEnum = 360845314;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB1555: SDL_PixelFormatEnum = 355667970;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA5551: SDL_PixelFormatEnum = 356782082;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR1555: SDL_PixelFormatEnum = 359862274;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA5551: SDL_PixelFormatEnum = 360976386;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB565: SDL_PixelFormatEnum = 353701890;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR565: SDL_PixelFormatEnum = 357896194;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB24: SDL_PixelFormatEnum = 386930691;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR24: SDL_PixelFormatEnum = 390076419;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XRGB8888: SDL_PixelFormatEnum = 370546692;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGB888: SDL_PixelFormatEnum = 370546692;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBX8888: SDL_PixelFormatEnum = 371595268;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_XBGR8888: SDL_PixelFormatEnum = 374740996;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGR888: SDL_PixelFormatEnum = 374740996;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRX8888: SDL_PixelFormatEnum = 375789572;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB8888: SDL_PixelFormatEnum = 372645892;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA8888: SDL_PixelFormatEnum = 373694468;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR8888: SDL_PixelFormatEnum = 376840196;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA8888: SDL_PixelFormatEnum = 377888772;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB2101010: SDL_PixelFormatEnum = 372711428;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum = 376840196;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum = 377888772;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum = 372645892;
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum = 373694468;
#[doc = "< Planar mode: Y + V + U  (3 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YV12: SDL_PixelFormatEnum = 842094169;
#[doc = "< Planar mode: Y + U + V  (3 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_IYUV: SDL_PixelFormatEnum = 1448433993;
#[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YUY2: SDL_PixelFormatEnum = 844715353;
#[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_UYVY: SDL_PixelFormatEnum = 1498831189;
#[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_YVYU: SDL_PixelFormatEnum = 1431918169;
#[doc = "< Planar mode: Y + U/V interleaved  (2 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_NV12: SDL_PixelFormatEnum = 842094158;
#[doc = "< Planar mode: Y + V/U interleaved  (2 planes)"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_NV21: SDL_PixelFormatEnum = 825382478;
#[doc = "< Android video texture format"]
pub const SDL_PixelFormatEnum_SDL_PIXELFORMAT_EXTERNAL_OES: SDL_PixelFormatEnum = 542328143;
pub type SDL_PixelFormatEnum = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Color>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: ::std::os::raw::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Palette>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Palette>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).ncolors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).colors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).version as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Palette>())).refcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = "  \\note Everything in the pixel format structure is read-only."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: ::std::os::raw::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    assert_eq!(
        ::std::mem::size_of::<SDL_PixelFormat>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_PixelFormat>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).palette as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).BitsPerPixel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).BytesPerPixel as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).padding as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gmask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bmask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Amask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rloss as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gloss as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bloss as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Aloss as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Rshift as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Gshift as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Bshift as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).Ashift as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).refcount as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_PixelFormat>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    #[doc = " Get the human readable name of a pixel format."]
    #[doc = ""]
    #[doc = " \\param format the pixel format to query"]
    #[doc = " \\returns the human readable name of the specified pixel format or"]
    #[doc = "          `SDL_PIXELFORMAT_UNKNOWN` if the format isn't recognized."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Convert one of the enumerated pixel formats to a bpp value and RGBA masks."]
    #[doc = ""]
    #[doc = " \\param format one of the SDL_PixelFormatEnum values"]
    #[doc = " \\param bpp a bits per pixel value; usually 15, 16, or 32"]
    #[doc = " \\param Rmask a pointer filled in with the red mask for the format"]
    #[doc = " \\param Gmask a pointer filled in with the green mask for the format"]
    #[doc = " \\param Bmask a pointer filled in with the blue mask for the format"]
    #[doc = " \\param Amask a pointer filled in with the alpha mask for the format"]
    #[doc = " \\returns SDL_TRUE on success or SDL_FALSE if the conversion wasn't"]
    #[doc = "          possible; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_MasksToPixelFormatEnum"]
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut ::std::os::raw::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Convert a bpp value and RGBA masks to an enumerated pixel format."]
    #[doc = ""]
    #[doc = " This will return `SDL_PIXELFORMAT_UNKNOWN` if the conversion wasn't"]
    #[doc = " possible."]
    #[doc = ""]
    #[doc = " \\param bpp a bits per pixel value; usually 15, 16, or 32"]
    #[doc = " \\param Rmask the red mask for the format"]
    #[doc = " \\param Gmask the green mask for the format"]
    #[doc = " \\param Bmask the blue mask for the format"]
    #[doc = " \\param Amask the alpha mask for the format"]
    #[doc = " \\returns one of the SDL_PixelFormatEnum values"]
    #[doc = ""]
    #[doc = " \\sa SDL_PixelFormatEnumToMasks"]
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: ::std::os::raw::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
extern "C" {
    #[doc = " Create an SDL_PixelFormat structure corresponding to a pixel format."]
    #[doc = ""]
    #[doc = " Returned structure may come from a shared global cache (i.e. not newly"]
    #[doc = " allocated), and hence should not be modified, especially the palette. Weird"]
    #[doc = " errors such as `Blit combination not supported` may occur."]
    #[doc = ""]
    #[doc = " \\param pixel_format one of the SDL_PixelFormatEnum values"]
    #[doc = " \\returns the new SDL_PixelFormat structure or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeFormat"]
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
extern "C" {
    #[doc = " Free an SDL_PixelFormat structure allocated by SDL_AllocFormat()."]
    #[doc = ""]
    #[doc = " \\param format the SDL_PixelFormat structure to free"]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocFormat"]
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
extern "C" {
    #[doc = " Create a palette structure with the specified number of color entries."]
    #[doc = ""]
    #[doc = " The palette entries are initialized to white."]
    #[doc = ""]
    #[doc = " \\param ncolors represents the number of color entries in the color palette"]
    #[doc = " \\returns a new SDL_Palette structure on success or NULL on failure (e.g. if"]
    #[doc = "          there wasn't enough memory); call SDL_GetError() for more"]
    #[doc = "          information."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreePalette"]
    pub fn SDL_AllocPalette(ncolors: ::std::os::raw::c_int) -> *mut SDL_Palette;
}
extern "C" {
    #[doc = " Set the palette for a pixel format structure."]
    #[doc = ""]
    #[doc = " \\param format the SDL_PixelFormat structure that will use the palette"]
    #[doc = " \\param palette the SDL_Palette structure that will be used"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    #[doc = " \\sa SDL_FreePalette"]
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set a range of colors in a palette."]
    #[doc = ""]
    #[doc = " \\param palette the SDL_Palette structure to modify"]
    #[doc = " \\param colors an array of SDL_Color structures to copy into the palette"]
    #[doc = " \\param firstcolor the index of the first palette entry to modify"]
    #[doc = " \\param ncolors the number of entries to modify"]
    #[doc = " \\returns 0 on success or a negative error code if not all of the colors"]
    #[doc = "          could be set; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: ::std::os::raw::c_int,
        ncolors: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Free a palette created with SDL_AllocPalette()."]
    #[doc = ""]
    #[doc = " \\param palette the SDL_Palette structure to be freed"]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocPalette"]
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
extern "C" {
    #[doc = " Map an RGB triple to an opaque pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = " This function maps the RGB color value to the specified pixel format and"]
    #[doc = " returns the pixel value best approximating the given RGB color value for"]
    #[doc = " the given pixel format."]
    #[doc = ""]
    #[doc = " If the format has a palette (8-bit) the index of the closest matching color"]
    #[doc = " in the palette will be returned."]
    #[doc = ""]
    #[doc = " If the specified pixel format has an alpha component it will be returned as"]
    #[doc = " all 1 bits (fully opaque)."]
    #[doc = ""]
    #[doc = " If the pixel format bpp (color depth) is less than 32-bpp then the unused"]
    #[doc = " upper bits of the return value can safely be ignored (e.g., with a 16-bpp"]
    #[doc = " format the return value can be assigned to a Uint16, and similarly a Uint8"]
    #[doc = " for an 8-bpp format)."]
    #[doc = ""]
    #[doc = " \\param format an SDL_PixelFormat structure describing the pixel format"]
    #[doc = " \\param r the red component of the pixel in the range 0-255"]
    #[doc = " \\param g the green component of the pixel in the range 0-255"]
    #[doc = " \\param b the blue component of the pixel in the range 0-255"]
    #[doc = " \\returns a pixel value"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    #[doc = " Map an RGBA quadruple to a pixel value for a given pixel format."]
    #[doc = ""]
    #[doc = " This function maps the RGBA color value to the specified pixel format and"]
    #[doc = " returns the pixel value best approximating the given RGBA color value for"]
    #[doc = " the given pixel format."]
    #[doc = ""]
    #[doc = " If the specified pixel format has no alpha component the alpha value will"]
    #[doc = " be ignored (as it will be in formats with a palette)."]
    #[doc = ""]
    #[doc = " If the format has a palette (8-bit) the index of the closest matching color"]
    #[doc = " in the palette will be returned."]
    #[doc = ""]
    #[doc = " If the pixel format bpp (color depth) is less than 32-bpp then the unused"]
    #[doc = " upper bits of the return value can safely be ignored (e.g., with a 16-bpp"]
    #[doc = " format the return value can be assigned to a Uint16, and similarly a Uint8"]
    #[doc = " for an 8-bpp format)."]
    #[doc = ""]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r the red component of the pixel in the range 0-255"]
    #[doc = " \\param g the green component of the pixel in the range 0-255"]
    #[doc = " \\param b the blue component of the pixel in the range 0-255"]
    #[doc = " \\param a the alpha component of the pixel in the range 0-255"]
    #[doc = " \\returns a pixel value"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGB"]
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    #[doc = " Get RGB values from a pixel in the specified format."]
    #[doc = ""]
    #[doc = " This function uses the entire 8-bit [0..255] range when converting color"]
    #[doc = " components from pixel formats with less than 8-bits per RGB component"]
    #[doc = " (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,"]
    #[doc = " 0xff, 0xff] not [0xf8, 0xfc, 0xf8])."]
    #[doc = ""]
    #[doc = " \\param pixel a pixel value"]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r a pointer filled in with the red component"]
    #[doc = " \\param g a pointer filled in with the green component"]
    #[doc = " \\param b a pointer filled in with the blue component"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGBA"]
    #[doc = " \\sa SDL_MapRGB"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    #[doc = " Get RGBA values from a pixel in the specified format."]
    #[doc = ""]
    #[doc = " This function uses the entire 8-bit [0..255] range when converting color"]
    #[doc = " components from pixel formats with less than 8-bits per RGB component"]
    #[doc = " (e.g., a completely white pixel in 16-bit RGB565 format would return [0xff,"]
    #[doc = " 0xff, 0xff] not [0xf8, 0xfc, 0xf8])."]
    #[doc = ""]
    #[doc = " If the surface has no alpha component, the alpha will be returned as 0xff"]
    #[doc = " (100% opaque)."]
    #[doc = ""]
    #[doc = " \\param pixel a pixel value"]
    #[doc = " \\param format an SDL_PixelFormat structure describing the format of the"]
    #[doc = "               pixel"]
    #[doc = " \\param r a pointer filled in with the red component"]
    #[doc = " \\param g a pointer filled in with the green component"]
    #[doc = " \\param b a pointer filled in with the blue component"]
    #[doc = " \\param a a pointer filled in with the alpha component"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetRGB"]
    #[doc = " \\sa SDL_MapRGB"]
    #[doc = " \\sa SDL_MapRGBA"]
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    #[doc = " Calculate a 256 entry gamma ramp for a gamma value."]
    #[doc = ""]
    #[doc = " \\param gamma a gamma value where 0.0 is black and 1.0 is identity"]
    #[doc = " \\param ramp an array of 256 values filled in with the gamma ramp"]
    #[doc = ""]
    #[doc = " \\sa SDL_SetWindowGammaRamp"]
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[doc = " The structure that defines a point (integer)"]
#[doc = ""]
#[doc = " \\sa SDL_EnclosePoints"]
#[doc = " \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Point {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Point() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Point>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Point))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Point))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Point>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Point>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " The structure that defines a point (floating point)"]
#[doc = ""]
#[doc = " \\sa SDL_EnclosePoints"]
#[doc = " \\sa SDL_PointInRect"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_SDL_FPoint() {
    assert_eq!(
        ::std::mem::size_of::<SDL_FPoint>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_FPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FPoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FPoint>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " A rectangle, with the origin at the upper left (integer)."]
#[doc = ""]
#[doc = " \\sa SDL_RectEmpty"]
#[doc = " \\sa SDL_RectEquals"]
#[doc = " \\sa SDL_HasIntersection"]
#[doc = " \\sa SDL_IntersectRect"]
#[doc = " \\sa SDL_UnionRect"]
#[doc = " \\sa SDL_EnclosePoints"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Rect {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub w: ::std::os::raw::c_int,
    pub h: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Rect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[doc = " A rectangle, with the origin at the upper left (floating point)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_SDL_FRect() {
    assert_eq!(
        ::std::mem::size_of::<SDL_FRect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_FRect))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_FRect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FRect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FRect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FRect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FRect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_FRect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    #[doc = " Determine whether two rectangles intersect."]
    #[doc = ""]
    #[doc = " If either pointer is NULL the function will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_IntersectRect"]
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the intersection of two rectangles."]
    #[doc = ""]
    #[doc = " If `result` is NULL then this function will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\param result an SDL_Rect structure filled in with the intersection of"]
    #[doc = "               rectangles `A` and `B`"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_HasIntersection"]
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the union of two rectangles."]
    #[doc = ""]
    #[doc = " \\param A an SDL_Rect structure representing the first rectangle"]
    #[doc = " \\param B an SDL_Rect structure representing the second rectangle"]
    #[doc = " \\param result an SDL_Rect structure filled in with the union of rectangles"]
    #[doc = "               `A` and `B`"]
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
extern "C" {
    #[doc = " Calculate a minimal rectangle enclosing a set of points."]
    #[doc = ""]
    #[doc = " If `clip` is not NULL then only points inside of the clipping rectangle are"]
    #[doc = " considered."]
    #[doc = ""]
    #[doc = " \\param points an array of SDL_Point structures representing points to be"]
    #[doc = "               enclosed"]
    #[doc = " \\param count the number of structures in the `points` array"]
    #[doc = " \\param clip an SDL_Rect used for clipping or NULL to enclose all points"]
    #[doc = " \\param result an SDL_Rect structure filled in with the minimal enclosing"]
    #[doc = "               rectangle"]
    #[doc = " \\returns SDL_TRUE if any points were enclosed or SDL_FALSE if all the"]
    #[doc = "          points were outside of the clipping rectangle."]
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: ::std::os::raw::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    #[doc = " Calculate the intersection of a rectangle and line segment."]
    #[doc = ""]
    #[doc = " This function is used to clip a line segment to a rectangle. A line segment"]
    #[doc = " contained entirely within the rectangle or that does not intersect will"]
    #[doc = " remain unchanged. A line segment that crosses the rectangle at either or"]
    #[doc = " both ends will be clipped to the boundary of the rectangle and the new"]
    #[doc = " coordinates saved in `X1`, `Y1`, `X2`, and/or `Y2` as necessary."]
    #[doc = ""]
    #[doc = " \\param rect an SDL_Rect structure representing the rectangle to intersect"]
    #[doc = " \\param X1 a pointer to the starting X-coordinate of the line"]
    #[doc = " \\param Y1 a pointer to the starting Y-coordinate of the line"]
    #[doc = " \\param X2 a pointer to the ending X-coordinate of the line"]
    #[doc = " \\param Y2 a pointer to the ending Y-coordinate of the line"]
    #[doc = " \\returns SDL_TRUE if there is an intersection, SDL_FALSE otherwise."]
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut ::std::os::raw::c_int,
        Y1: *mut ::std::os::raw::c_int,
        X2: *mut ::std::os::raw::c_int,
        Y2: *mut ::std::os::raw::c_int,
    ) -> SDL_bool;
}
#[doc = "< no blending"]
#[doc = "dstRGBA = srcRGBA"]
pub const SDL_BlendMode_SDL_BLENDMODE_NONE: SDL_BlendMode = 0;
#[doc = "< alpha blending"]
#[doc = "dstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))"]
#[doc = "dstA = srcA + (dstA * (1-srcA))"]
pub const SDL_BlendMode_SDL_BLENDMODE_BLEND: SDL_BlendMode = 1;
#[doc = "< additive blending"]
#[doc = "dstRGB = (srcRGB * srcA) + dstRGB"]
#[doc = "dstA = dstA"]
pub const SDL_BlendMode_SDL_BLENDMODE_ADD: SDL_BlendMode = 2;
#[doc = "< color modulate"]
#[doc = "dstRGB = srcRGB * dstRGB"]
#[doc = "dstA = dstA"]
pub const SDL_BlendMode_SDL_BLENDMODE_MOD: SDL_BlendMode = 4;
#[doc = "< color multiply"]
#[doc = "dstRGB = (srcRGB * dstRGB) + (dstRGB * (1-srcA))"]
#[doc = "dstA = (srcA * dstA) + (dstA * (1-srcA))"]
pub const SDL_BlendMode_SDL_BLENDMODE_MUL: SDL_BlendMode = 8;
pub const SDL_BlendMode_SDL_BLENDMODE_INVALID: SDL_BlendMode = 2147483647;
#[doc = "  \\brief The blend mode used in SDL_RenderCopy() and drawing operations."]
pub type SDL_BlendMode = ::std::os::raw::c_uint;
#[doc = "< dst + src: supported by all renderers"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_ADD: SDL_BlendOperation = 1;
#[doc = "< dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_SUBTRACT: SDL_BlendOperation = 2;
#[doc = "< src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_REV_SUBTRACT: SDL_BlendOperation = 3;
#[doc = "< min(dst, src) : supported by D3D11"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_MINIMUM: SDL_BlendOperation = 4;
#[doc = "< max(dst, src) : supported by D3D11"]
pub const SDL_BlendOperation_SDL_BLENDOPERATION_MAXIMUM: SDL_BlendOperation = 5;
#[doc = "  \\brief The blend operation used when combining source and destination pixel components"]
pub type SDL_BlendOperation = ::std::os::raw::c_uint;
#[doc = "< 0, 0, 0, 0"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ZERO: SDL_BlendFactor = 1;
#[doc = "< 1, 1, 1, 1"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE: SDL_BlendFactor = 2;
#[doc = "< srcR, srcG, srcB, srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_COLOR: SDL_BlendFactor = 3;
#[doc = "< 1-srcR, 1-srcG, 1-srcB, 1-srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR: SDL_BlendFactor = 4;
#[doc = "< srcA, srcA, srcA, srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_ALPHA: SDL_BlendFactor = 5;
#[doc = "< 1-srcA, 1-srcA, 1-srcA, 1-srcA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA: SDL_BlendFactor = 6;
#[doc = "< dstR, dstG, dstB, dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_COLOR: SDL_BlendFactor = 7;
#[doc = "< 1-dstR, 1-dstG, 1-dstB, 1-dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR: SDL_BlendFactor = 8;
#[doc = "< dstA, dstA, dstA, dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_ALPHA: SDL_BlendFactor = 9;
#[doc = "< 1-dstA, 1-dstA, 1-dstA, 1-dstA"]
pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA: SDL_BlendFactor = 10;
#[doc = "  \\brief The normalized factor used to multiply pixel components"]
pub type SDL_BlendFactor = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Compose a custom blend mode for renderers."]
    #[doc = ""]
    #[doc = " The functions SDL_SetRenderDrawBlendMode and SDL_SetTextureBlendMode accept"]
    #[doc = " the SDL_BlendMode returned by this function if the renderer supports it."]
    #[doc = ""]
    #[doc = " A blend mode controls how the pixels from a drawing operation (source) get"]
    #[doc = " combined with the pixels from the render target (destination). First, the"]
    #[doc = " components of the source and destination pixels get multiplied with their"]
    #[doc = " blend factors. Then, the blend operation takes the two products and"]
    #[doc = " calculates the result that will get stored in the render target."]
    #[doc = ""]
    #[doc = " Expressed in pseudocode, it would look like this:"]
    #[doc = ""]
    #[doc = " ```c"]
    #[doc = " dstRGB = colorOperation(srcRGB * srcColorFactor, dstRGB * dstColorFactor);"]
    #[doc = " dstA = alphaOperation(srcA * srcAlphaFactor, dstA * dstAlphaFactor);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " Where the functions `colorOperation(src, dst)` and `alphaOperation(src,"]
    #[doc = " dst)` can return one of the following:"]
    #[doc = ""]
    #[doc = " - `src + dst`"]
    #[doc = " - `src - dst`"]
    #[doc = " - `dst - src`"]
    #[doc = " - `min(src, dst)`"]
    #[doc = " - `max(src, dst)`"]
    #[doc = ""]
    #[doc = " The red, green, and blue components are always multiplied with the first,"]
    #[doc = " second, and third components of the SDL_BlendFactor, respectively. The"]
    #[doc = " fourth component is not used."]
    #[doc = ""]
    #[doc = " The alpha component is always multiplied with the fourth component of the"]
    #[doc = " SDL_BlendFactor. The other components are not used in the alpha"]
    #[doc = " calculation."]
    #[doc = ""]
    #[doc = " Support for these blend modes varies for each renderer. To check if a"]
    #[doc = " specific SDL_BlendMode is supported, create a renderer and pass it to"]
    #[doc = " either SDL_SetRenderDrawBlendMode or SDL_SetTextureBlendMode. They will"]
    #[doc = " return with an error if the blend mode is not supported."]
    #[doc = ""]
    #[doc = " This list describes the support of custom blend modes for each renderer in"]
    #[doc = " SDL 2.0.6. All renderers support the four blend modes listed in the"]
    #[doc = " SDL_BlendMode enumeration."]
    #[doc = ""]
    #[doc = " - **direct3d**: Supports `SDL_BLENDOPERATION_ADD` with all factors."]
    #[doc = " - **direct3d11**: Supports all operations with all factors. However, some"]
    #[doc = "   factors produce unexpected results with `SDL_BLENDOPERATION_MINIMUM` and"]
    #[doc = "   `SDL_BLENDOPERATION_MAXIMUM`."]
    #[doc = " - **opengl**: Supports the `SDL_BLENDOPERATION_ADD` operation with all"]
    #[doc = "   factors. OpenGL versions 1.1, 1.2, and 1.3 do not work correctly with SDL"]
    #[doc = "   2.0.6."]
    #[doc = " - **opengles**: Supports the `SDL_BLENDOPERATION_ADD` operation with all"]
    #[doc = "   factors. Color and alpha factors need to be the same. OpenGL ES 1"]
    #[doc = "   implementation specific: May also support `SDL_BLENDOPERATION_SUBTRACT`"]
    #[doc = "   and `SDL_BLENDOPERATION_REV_SUBTRACT`. May support color and alpha"]
    #[doc = "   operations being different from each other. May support color and alpha"]
    #[doc = "   factors being different from each other."]
    #[doc = " - **opengles2**: Supports the `SDL_BLENDOPERATION_ADD`,"]
    #[doc = "   `SDL_BLENDOPERATION_SUBTRACT`, `SDL_BLENDOPERATION_REV_SUBTRACT`"]
    #[doc = "   operations with all factors."]
    #[doc = " - **psp**: No custom blend mode support."]
    #[doc = " - **software**: No custom blend mode support."]
    #[doc = ""]
    #[doc = " Some renderers do not provide an alpha component for the default render"]
    #[doc = " target. The `SDL_BLENDFACTOR_DST_ALPHA` and"]
    #[doc = " `SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA` factors do not have an effect in this"]
    #[doc = " case."]
    #[doc = ""]
    #[doc = " \\param srcColorFactor the SDL_BlendFactor applied to the red, green, and"]
    #[doc = "                       blue components of the source pixels"]
    #[doc = " \\param dstColorFactor the SDL_BlendFactor applied to the red, green, and"]
    #[doc = "                       blue components of the destination pixels"]
    #[doc = " \\param colorOperation the SDL_BlendOperation used to combine the red,"]
    #[doc = "                       green, and blue components of the source and"]
    #[doc = "                       destination pixels"]
    #[doc = " \\param srcAlphaFactor the SDL_BlendFactor applied to the alpha component of"]
    #[doc = "                       the source pixels"]
    #[doc = " \\param dstAlphaFactor the SDL_BlendFactor applied to the alpha component of"]
    #[doc = "                       the destination pixels"]
    #[doc = " \\param alphaOperation the SDL_BlendOperation used to combine the alpha"]
    #[doc = "                       component of the source and destination pixels"]
    #[doc = " \\returns an SDL_BlendMode that represents the chosen factors and"]
    #[doc = "          operations."]
    #[doc = ""]
    #[doc = " \\since This function is available in SDL 2.0.6."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetRenderDrawBlendMode"]
    #[doc = " \\sa SDL_GetRenderDrawBlendMode"]
    #[doc = " \\sa SDL_SetTextureBlendMode"]
    #[doc = " \\sa SDL_GetTextureBlendMode"]
    pub fn SDL_ComposeCustomBlendMode(
        srcColorFactor: SDL_BlendFactor,
        dstColorFactor: SDL_BlendFactor,
        colorOperation: SDL_BlendOperation,
        srcAlphaFactor: SDL_BlendFactor,
        dstAlphaFactor: SDL_BlendFactor,
        alphaOperation: SDL_BlendOperation,
    ) -> SDL_BlendMode;
}
#[doc = " \\brief A collection of pixels used in software blitting."]
#[doc = ""]
#[doc = " \\note  This structure should be treated as read-only, except for \\c pixels,"]
#[doc = "        which, if not NULL, contains the raw pixel data for the surface."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Surface {
    #[doc = "< Read-only"]
    pub flags: Uint32,
    #[doc = "< Read-only"]
    pub format: *mut SDL_PixelFormat,
    #[doc = "< Read-only"]
    pub w: ::std::os::raw::c_int,
    #[doc = "< Read-only"]
    pub h: ::std::os::raw::c_int,
    #[doc = "< Read-only"]
    pub pitch: ::std::os::raw::c_int,
    #[doc = "< Read-write"]
    pub pixels: *mut ::std::os::raw::c_void,
    #[doc = "< Read-write"]
    pub userdata: *mut ::std::os::raw::c_void,
    #[doc = "< Read-only"]
    pub locked: ::std::os::raw::c_int,
    #[doc = "< Private"]
    pub list_blitmap: *mut ::std::os::raw::c_void,
    #[doc = "< Read-only"]
    pub clip_rect: SDL_Rect,
    #[doc = "< Private"]
    pub map: *mut SDL_BlitMap,
    #[doc = "< Read-mostly"]
    pub refcount: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Surface() {
    assert_eq!(
        ::std::mem::size_of::<SDL_Surface>(),
        96usize,
        concat!("Size of: ", stringify!(SDL_Surface))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_Surface>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Surface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).pitch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).pixels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).userdata as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).locked as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).list_blitmap as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(list_blitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).clip_rect as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(clip_rect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).map as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_Surface>())).refcount as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(refcount)
        )
    );
}
#[doc = " \\brief The type of function used for surface blitting functions."]
pub type SDL_blit = ::std::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int,
>;
#[doc = "< Full range JPEG"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_JPEG: SDL_YUV_CONVERSION_MODE = 0;
#[doc = "< BT.601 (the default)"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT601: SDL_YUV_CONVERSION_MODE = 1;
#[doc = "< BT.709"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT709: SDL_YUV_CONVERSION_MODE = 2;
#[doc = "< BT.601 for SD content, BT.709 for HD content"]
pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_AUTOMATIC: SDL_YUV_CONVERSION_MODE = 3;
#[doc = " \\brief The formula used for converting between YUV and RGB"]
pub type SDL_YUV_CONVERSION_MODE = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Allocate a new RGB surface."]
    #[doc = ""]
    #[doc = " If `depth` is 4 or 8 bits, an empty palette is allocated for the surface."]
    #[doc = " If `depth` is greater than 8 bits, the pixel format is set using the"]
    #[doc = " [RGBA]mask parameters."]
    #[doc = ""]
    #[doc = " The [RGBA]mask parameters are the bitmasks used to extract that color from"]
    #[doc = " a pixel. For instance, `Rmask` being 0xFF000000 means the red data is"]
    #[doc = " stored in the most significant byte. Using zeros for the RGB masks sets a"]
    #[doc = " default value, based on the depth. For example:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_CreateRGBSurface(0,w,h,32,0,0,0,0);"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " However, using zero for the Amask results in an Amask of 0."]
    #[doc = ""]
    #[doc = " By default surfaces with an alpha mask are set up for blending as with:"]
    #[doc = ""]
    #[doc = " ```c++"]
    #[doc = " SDL_SetSurfaceBlendMode(surface, SDL_BLENDMODE_BLEND)"]
    #[doc = " ```"]
    #[doc = ""]
    #[doc = " You can change this by calling SDL_SetSurfaceBlendMode() and selecting a"]
    #[doc = " different `blendMode`."]
    #[doc = ""]
    #[doc = " \\param flags the flags are unused and should be set to 0"]
    #[doc = " \\param width the width of the surface"]
    #[doc = " \\param height the height of the surface"]
    #[doc = " \\param depth the depth of the surface in bits"]
    #[doc = " \\param Rmask the red mask for the pixels"]
    #[doc = " \\param Gmask the green mask for the pixels"]
    #[doc = " \\param Bmask the blue mask for the pixels"]
    #[doc = " \\param Amask the alpha mask for the pixels"]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateRGBSurfaceFrom"]
    #[doc = " \\sa SDL_CreateRGBSurfaceWithFormat"]
    #[doc = " \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Allocate a new RGB surface with a specific pixel format."]
    #[doc = ""]
    #[doc = " This function operates mostly like SDL_CreateRGBSurface(), except instead"]
    #[doc = " of providing pixel color masks, you provide it with a predefined format"]
    #[doc = " from SDL_PixelFormatEnum."]
    #[doc = ""]
    #[doc = " \\param flags the flags are unused and should be set to 0"]
    #[doc = " \\param width the width of the surface"]
    #[doc = " \\param height the height of the surface"]
    #[doc = " \\param depth the depth of the surface in bits"]
    #[doc = " \\param format the SDL_PixelFormatEnum for the new surface's pixel format."]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    #[doc = " \\sa SDL_CreateRGBSurfaceFrom"]
    #[doc = " \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceWithFormat(
        flags: Uint32,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Allocate a new RGB surface with existing pixel data."]
    #[doc = ""]
    #[doc = " This function operates mostly like SDL_CreateRGBSurface(), except it does"]
    #[doc = " not allocate memory for the pixel data, instead the caller provides an"]
    #[doc = " existing buffer of data for the surface to use."]
    #[doc = ""]
    #[doc = " No copy is made of the pixel data. Pixel data is not managed automatically;"]
    #[doc = " you must free the surface before you free the pixel data."]
    #[doc = ""]
    #[doc = " \\param pixels a pointer to existing pixel data"]
    #[doc = " \\param width the width of the surface"]
    #[doc = " \\param height the height of the surface"]
    #[doc = " \\param depth the depth of the surface in bits"]
    #[doc = " \\param pitch the pitch of the surface in bytes"]
    #[doc = " \\param Rmask the red mask for the pixels"]
    #[doc = " \\param Gmask the green mask for the pixels"]
    #[doc = " \\param Bmask the blue mask for the pixels"]
    #[doc = " \\param Amask the alpha mask for the pixels"]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    #[doc = " \\sa SDL_CreateRGBSurfaceWithFormat"]
    #[doc = " \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut ::std::os::raw::c_void,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        pitch: ::std::os::raw::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Allocate a new RGB surface with with a specific pixel format and existing"]
    #[doc = " pixel data."]
    #[doc = ""]
    #[doc = " This function operates mostly like SDL_CreateRGBSurfaceFrom(), except"]
    #[doc = " instead of providing pixel color masks, you provide it with a predefined"]
    #[doc = " format from SDL_PixelFormatEnum."]
    #[doc = ""]
    #[doc = " No copy is made of the pixel data. Pixel data is not managed automatically;"]
    #[doc = " you must free the surface before you free the pixel data."]
    #[doc = ""]
    #[doc = " \\param pixels a pointer to existing pixel data"]
    #[doc = " \\param width the width of the surface"]
    #[doc = " \\param height the height of the surface"]
    #[doc = " \\param depth the depth of the surface in bits"]
    #[doc = " \\param pitch the pitch of the surface in bytes"]
    #[doc = " \\param format the SDL_PixelFormatEnum for the new surface's pixel format."]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateRGBSurfaceFrom"]
    #[doc = " \\sa SDL_CreateRGBSurfaceWithFormat"]
    #[doc = " \\sa SDL_FreeSurface"]
    pub fn SDL_CreateRGBSurfaceWithFormatFrom(
        pixels: *mut ::std::os::raw::c_void,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        depth: ::std::os::raw::c_int,
        pitch: ::std::os::raw::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Free an RGB surface."]
    #[doc = ""]
    #[doc = " It is safe to pass NULL to this function."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface to free."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    #[doc = " \\sa SDL_CreateRGBSurfaceFrom"]
    #[doc = " \\sa SDL_LoadBMP"]
    #[doc = " \\sa SDL_LoadBMP_RW"]
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = " Set the palette used by a surface."]
    #[doc = ""]
    #[doc = " A single palette can be shared with many surfaces."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to update"]
    #[doc = " \\param palette the SDL_Palette structure to use"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    pub fn SDL_SetSurfacePalette(
        surface: *mut SDL_Surface,
        palette: *mut SDL_Palette,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set up a surface for directly accessing the pixels."]
    #[doc = ""]
    #[doc = " Between calls to SDL_LockSurface() / SDL_UnlockSurface(), you can write to"]
    #[doc = " and read from `surface->pixels`, using the pixel format stored in"]
    #[doc = " `surface->format`. Once you are done accessing the surface, you should use"]
    #[doc = " SDL_UnlockSurface() to release it."]
    #[doc = ""]
    #[doc = " Not all surfaces require locking. If `SDL_MUSTLOCK(surface)` evaluates to"]
    #[doc = " 0, then you can read and write to the surface at any time, and the pixel"]
    #[doc = " format of the surface will not change."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to be locked"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_MUSTLOCK"]
    #[doc = " \\sa SDL_UnlockSurface"]
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Release a surface after directly accessing the pixels."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to be unlocked"]
    #[doc = ""]
    #[doc = " \\sa SDL_LockSurface"]
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
extern "C" {
    #[doc = " Load a BMP image from a seekable SDL data stream."]
    #[doc = ""]
    #[doc = " The new surface should be freed with SDL_FreeSurface()."]
    #[doc = ""]
    #[doc = " \\param src the data stream for the surface"]
    #[doc = " \\param freesrc non-zero to close the stream after being read"]
    #[doc = " \\returns a pointer to a new SDL_Surface structure or NULL if there was an"]
    #[doc = "          error; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_FreeSurface"]
    #[doc = " \\sa SDL_LoadBMP"]
    #[doc = " \\sa SDL_SaveBMP_RW"]
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: ::std::os::raw::c_int) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Save a surface to a seekable SDL data stream in BMP format."]
    #[doc = ""]
    #[doc = " Surfaces with a 24-bit, 32-bit and paletted 8-bit format get saved in the"]
    #[doc = " BMP directly. Other RGB formats with 8-bit or higher get converted to a"]
    #[doc = " 24-bit surface or, if they have an alpha mask or a colorkey, to a 32-bit"]
    #[doc = " surface before they are saved. YUV and paletted 1-bit and 4-bit formats are"]
    #[doc = " not supported."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure containing the image to be saved"]
    #[doc = " \\param dst a data stream to save to"]
    #[doc = " \\param freedst non-zero to close the stream after being written"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_LoadBMP_RW"]
    #[doc = " \\sa SDL_SaveBMP"]
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the RLE acceleration hint for a surface."]
    #[doc = ""]
    #[doc = " If RLE is enabled, color key and alpha blending blits are much faster, but"]
    #[doc = " the surface must be locked before directly accessing the pixels."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to optimize"]
    #[doc = " \\param flag 0 to disable, non-zero to enable RLE acceleration"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    #[doc = " \\sa SDL_LockSurface"]
    #[doc = " \\sa SDL_UnlockSurface"]
    pub fn SDL_SetSurfaceRLE(
        surface: *mut SDL_Surface,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns whether the surface is RLE enabled"]
    #[doc = ""]
    #[doc = " It is safe to pass a NULL `surface` here; it will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\returns SDL_TRUE if the surface is RLE enabled, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetSurfaceRLE"]
    pub fn SDL_HasSurfaceRLE(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    #[doc = " Set the color key (transparent pixel) in a surface."]
    #[doc = ""]
    #[doc = " The color key defines a pixel value that will be treated as transparent in"]
    #[doc = " a blit. For example, one can use this to specify that cyan pixels should be"]
    #[doc = " considered transparent, and therefore not rendered."]
    #[doc = ""]
    #[doc = " It is a pixel of the format used by the surface, as generated by"]
    #[doc = " SDL_MapRGB()."]
    #[doc = ""]
    #[doc = " RLE acceleration can substantially speed up blitting of images with large"]
    #[doc = " horizontal runs of transparent pixels. See SDL_SetSurfaceRLE() for details."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to update"]
    #[doc = " \\param flag SDL_TRUE to enable color key, SDL_FALSE to disable color key"]
    #[doc = " \\param key the transparent pixel"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    #[doc = " \\sa SDL_GetColorKey"]
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: ::std::os::raw::c_int,
        key: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns whether the surface has a color key"]
    #[doc = ""]
    #[doc = " It is safe to pass a NULL `surface` here; it will return SDL_FALSE."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\return SDL_TRUE if the surface has a color key, SDL_FALSE otherwise."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetColorKey"]
    #[doc = " \\sa SDL_GetColorKey"]
    pub fn SDL_HasColorKey(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    #[doc = " Get the color key (transparent pixel) for a surface."]
    #[doc = ""]
    #[doc = " The color key is a pixel of the format used by the surface, as generated by"]
    #[doc = " SDL_MapRGB()."]
    #[doc = ""]
    #[doc = " If the surface doesn't have color key enabled this function returns -1."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\param key a pointer filled in with the transparent pixel"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    #[doc = " \\sa SDL_SetColorKey"]
    pub fn SDL_GetColorKey(surface: *mut SDL_Surface, key: *mut Uint32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set an additional color value multiplied into blit operations."]
    #[doc = ""]
    #[doc = " When this surface is blitted, during the blit operation each source color"]
    #[doc = " channel is modulated by the appropriate color value according to the"]
    #[doc = " following formula:"]
    #[doc = ""]
    #[doc = " `srcC = srcC * (color / 255)`"]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to update"]
    #[doc = " \\param r the red color value multiplied into blit operations"]
    #[doc = " \\param g the green color value multiplied into blit operations"]
    #[doc = " \\param b the blue color value multiplied into blit operations"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetSurfaceColorMod"]
    #[doc = " \\sa SDL_SetSurfaceAlphaMod"]
    pub fn SDL_SetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: Uint8,
        g: Uint8,
        b: Uint8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the additional color value multiplied into blit operations."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\param r a pointer filled in with the current red color value"]
    #[doc = " \\param g a pointer filled in with the current green color value"]
    #[doc = " \\param b a pointer filled in with the current blue color value"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetSurfaceAlphaMod"]
    #[doc = " \\sa SDL_SetSurfaceColorMod"]
    pub fn SDL_GetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set an additional alpha value used in blit operations."]
    #[doc = ""]
    #[doc = " When this surface is blitted, during the blit operation the source alpha"]
    #[doc = " value is modulated by this alpha value according to the following formula:"]
    #[doc = ""]
    #[doc = " `srcA = srcA * (alpha / 255)`"]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to update"]
    #[doc = " \\param alpha the alpha value multiplied into blit operations"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetSurfaceAlphaMod"]
    #[doc = " \\sa SDL_SetSurfaceColorMod"]
    pub fn SDL_SetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: Uint8)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the additional alpha value used in blit operations."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\param alpha a pointer filled in with the current alpha value"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetSurfaceColorMod"]
    #[doc = " \\sa SDL_SetSurfaceAlphaMod"]
    pub fn SDL_GetSurfaceAlphaMod(
        surface: *mut SDL_Surface,
        alpha: *mut Uint8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the blend mode used for blit operations."]
    #[doc = ""]
    #[doc = " To copy a surface to another surface (or texture) without blending with the"]
    #[doc = " existing data, the blendmode of the SOURCE surface should be set to"]
    #[doc = " `SDL_BLENDMODE_NONE`."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to update"]
    #[doc = " \\param blendMode the SDL_BlendMode to use for blit blending"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetSurfaceBlendMode"]
    pub fn SDL_SetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: SDL_BlendMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the blend mode used for blit operations."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to query"]
    #[doc = " \\param blendMode a pointer filled in with the current SDL_BlendMode"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetSurfaceBlendMode"]
    pub fn SDL_GetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: *mut SDL_BlendMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the clipping rectangle for a surface."]
    #[doc = ""]
    #[doc = " When `surface` is the destination of a blit, only the area within the clip"]
    #[doc = " rectangle is drawn into."]
    #[doc = ""]
    #[doc = " Note that blits are automatically clipped to the edges of the source and"]
    #[doc = " destination surfaces."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure to be clipped"]
    #[doc = " \\param rect the SDL_Rect structure representing the clipping rectangle, or"]
    #[doc = "             NULL to disable clipping"]
    #[doc = " \\returns SDL_TRUE if the rectangle intersects the surface, otherwise"]
    #[doc = "          SDL_FALSE and blits will be completely clipped."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    #[doc = " \\sa SDL_GetClipRect"]
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    #[doc = " Get the clipping rectangle for a surface."]
    #[doc = ""]
    #[doc = " When `surface` is the destination of a blit, only the area within the clip"]
    #[doc = " rectangle is drawn into."]
    #[doc = ""]
    #[doc = " \\param surface the SDL_Surface structure representing the surface to be"]
    #[doc = "                clipped"]
    #[doc = " \\param rect an SDL_Rect structure filled in with the clipping rectangle for"]
    #[doc = "             the surface"]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    #[doc = " \\sa SDL_SetClipRect"]
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_DuplicateSurface(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Copy an existing surface to a new surface of the specified format."]
    #[doc = ""]
    #[doc = " This function is used to optimize images for faster *repeat* blitting. This"]
    #[doc = " is accomplished by converting the original and storing the result as a new"]
    #[doc = " surface. The new, optimized surface can then be used as the source for"]
    #[doc = " future blits, making them faster."]
    #[doc = ""]
    #[doc = " \\param src the existing SDL_Surface structure to convert"]
    #[doc = " \\param fmt the SDL_PixelFormat structure that the new surface is optimized"]
    #[doc = "            for"]
    #[doc = " \\param flags the flags are unused and should be set to 0; this is a"]
    #[doc = "              leftover from SDL 1.2's API"]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocFormat"]
    #[doc = " \\sa SDL_ConvertSurfaceFormat"]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *const SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Copy an existing surface to a new surface of the specified format enum."]
    #[doc = ""]
    #[doc = " This function operates just like SDL_ConvertSurface(), but accepts an"]
    #[doc = " SDL_PixelFormatEnum value instead of an SDL_PixelFormat structure. As such,"]
    #[doc = " it might be easier to call but it doesn't have access to palette"]
    #[doc = " information for the destination surface, in case that would be important."]
    #[doc = ""]
    #[doc = " \\param src the existing SDL_Surface structure to convert"]
    #[doc = " \\param pixel_format the SDL_PixelFormatEnum that the new surface is"]
    #[doc = "                     optimized for"]
    #[doc = " \\param flags the flags are unused and should be set to 0; this is a"]
    #[doc = "              leftover from SDL 1.2's API"]
    #[doc = " \\returns the new SDL_Surface structure that is created or NULL if it fails;"]
    #[doc = "          call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_AllocFormat"]
    #[doc = " \\sa SDL_ConvertSurfaceFormat"]
    #[doc = " \\sa SDL_CreateRGBSurface"]
    pub fn SDL_ConvertSurfaceFormat(
        src: *mut SDL_Surface,
        pixel_format: Uint32,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    #[doc = " Copy a block of pixels of one format to another format."]
    #[doc = ""]
    #[doc = " \\param width the width of the block to copy, in pixels"]
    #[doc = " \\param height the height of the block to copy, in pixels"]
    #[doc = " \\param src_format an SDL_PixelFormatEnum value of the `src` pixels format"]
    #[doc = " \\param src a pointer to the source pixels"]
    #[doc = " \\param src_pitch the pitch of the block to copy, in bytes"]
    #[doc = " \\param dst_format an SDL_PixelFormatEnum value of the `dst` pixels format"]
    #[doc = " \\param dst a pointer to be filled in with new pixel data"]
    #[doc = " \\param dst_pitch the pitch of the destination pixels, in bytes"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    pub fn SDL_ConvertPixels(
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        src_format: Uint32,
        src: *const ::std::os::raw::c_void,
        src_pitch: ::std::os::raw::c_int,
        dst_format: Uint32,
        dst: *mut ::std::os::raw::c_void,
        dst_pitch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform a fast fill of a rectangle with a specific color."]
    #[doc = ""]
    #[doc = " `color` should be a pixel of the format used by the surface, and can be"]
    #[doc = " generated by SDL_MapRGB() or SDL_MapRGBA(). If the color value contains an"]
    #[doc = " alpha component then the destination is simply filled with that alpha"]
    #[doc = " information, no blending takes place."]
    #[doc = ""]
    #[doc = " If there is a clip rectangle set on the destination (set via"]
    #[doc = " SDL_SetClipRect()), then this function will fill based on the intersection"]
    #[doc = " of the clip rectangle and `rect`."]
    #[doc = ""]
    #[doc = " \\param dst the SDL_Surface structure that is the drawing target"]
    #[doc = " \\param rect the SDL_Rect structure representing the rectangle to fill, or"]
    #[doc = "             NULL to fill the entire surface"]
    #[doc = " \\param color the color to fill with"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_FillRects"]
    pub fn SDL_FillRect(
        dst: *mut SDL_Surface,
        rect: *const SDL_Rect,
        color: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform a fast fill of a set of rectangles with a specific color."]
    #[doc = ""]
    #[doc = " `color` should be a pixel of the format used by the surface, and can be"]
    #[doc = " generated by SDL_MapRGB() or SDL_MapRGBA(). If the color value contains an"]
    #[doc = " alpha component then the destination is simply filled with that alpha"]
    #[doc = " information, no blending takes place."]
    #[doc = ""]
    #[doc = " If there is a clip rectangle set on the destination (set via"]
    #[doc = " SDL_SetClipRect()), then this function will fill based on the intersection"]
    #[doc = " of the clip rectangle and `rect`."]
    #[doc = ""]
    #[doc = " \\param dst the SDL_Surface structure that is the drawing target"]
    #[doc = " \\param rects an array of SDL_Rects representing the rectangles to fill."]
    #[doc = " \\param count the number of rectangles in the array"]
    #[doc = " \\param color the color to fill with"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_FillRect"]
    pub fn SDL_FillRects(
        dst: *mut SDL_Surface,
        rects: *const SDL_Rect,
        count: ::std::os::raw::c_int,
        color: Uint32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform a fast blit from the source surface to the destination surface."]
    #[doc = ""]
    #[doc = " SDL_UpperBlit() has been replaced by SDL_BlitSurface(), which is merely a"]
    #[doc = " macro for this function with a less confusing name."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform low-level surface blitting only."]
    #[doc = ""]
    #[doc = " This is a semi-private blit function and it performs low-level surface"]
    #[doc = " blitting, assuming the input rectangles have already been clipped."]
    #[doc = ""]
    #[doc = " Unless you know what you're doing, you should be using SDL_BlitSurface()"]
    #[doc = " instead."]
    #[doc = ""]
    #[doc = " \\param src the SDL_Surface structure to be copied from"]
    #[doc = " \\param srcrect the SDL_Rect structure representing the rectangle to be"]
    #[doc = "                copied, or NULL to copy the entire surface"]
    #[doc = " \\param dst the SDL_Surface structure that is the blit target"]
    #[doc = " \\param dstrect the SDL_Rect structure representing the rectangle that is"]
    #[doc = "                copied into"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitSurface"]
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform a fast, low quality, stretch blit between two surfaces of the"]
    #[doc = " same format."]
    #[doc = ""]
    #[doc = " Please use SDL_BlitScaled() instead."]
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform bilinear scaling between two surfaces of the same format, 32BPP."]
    pub fn SDL_SoftStretchLinear(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform a scaled surface copy to a destination surface."]
    #[doc = ""]
    #[doc = " SDL_UpperBlitScaled() has been replaced by SDL_BlitScaled(), which is"]
    #[doc = " merely a macro for this function with a less confusing name."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitScaled"]
    pub fn SDL_UpperBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Perform low-level surface scaled blitting only."]
    #[doc = ""]
    #[doc = " This is a semi-private function and it performs low-level surface blitting,"]
    #[doc = " assuming the input rectangles have already been clipped."]
    #[doc = ""]
    #[doc = " \\param src the SDL_Surface structure to be copied from"]
    #[doc = " \\param srcrect the SDL_Rect structure representing the rectangle to be"]
    #[doc = "                copied"]
    #[doc = " \\param dst the SDL_Surface structure that is the blit target"]
    #[doc = " \\param dstrect the SDL_Rect structure representing the rectangle that is"]
    #[doc = "                copied into"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_BlitScaled"]
    pub fn SDL_LowerBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the YUV conversion mode"]
    pub fn SDL_SetYUVConversionMode(mode: SDL_YUV_CONVERSION_MODE);
}
extern "C" {
    #[doc = " Get the YUV conversion mode"]
    pub fn SDL_GetYUVConversionMode() -> SDL_YUV_CONVERSION_MODE;
}
extern "C" {
    #[doc = " Get the YUV conversion mode, returning the correct mode for the resolution"]
    #[doc = " when the current conversion mode is SDL_YUV_CONVERSION_AUTOMATIC"]
    pub fn SDL_GetYUVConversionModeForResolution(
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> SDL_YUV_CONVERSION_MODE;
}
#[doc = "  \\brief  The structure that defines a display mode"]
#[doc = ""]
#[doc = "  \\sa SDL_GetNumDisplayModes()"]
#[doc = "  \\sa SDL_GetDisplayMode()"]
#[doc = "  \\sa SDL_GetDesktopDisplayMode()"]
#[doc = "  \\sa SDL_GetCurrentDisplayMode()"]
#[doc = "  \\sa SDL_GetClosestDisplayMode()"]
#[doc = "  \\sa SDL_SetWindowDisplayMode()"]
#[doc = "  \\sa SDL_GetWindowDisplayMode()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_DisplayMode {
    #[doc = "< pixel format"]
    pub format: Uint32,
    #[doc = "< width, in screen coordinates"]
    pub w: ::std::os::raw::c_int,
    #[doc = "< height, in screen coordinates"]
    pub h: ::std::os::raw::c_int,
    #[doc = "< refresh rate (or zero for unspecified)"]
    pub refresh_rate: ::std::os::raw::c_int,
    #[doc = "< driver-specific data, initialize to 0"]
    pub driverdata: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_SDL_DisplayMode() {
    assert_eq!(
        ::std::mem::size_of::<SDL_DisplayMode>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        ::std::mem::align_of::<SDL_DisplayMode>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_DisplayMode>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_DisplayMode>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_DisplayMode>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_DisplayMode>())).refresh_rate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(refresh_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SDL_DisplayMode>())).driverdata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(driverdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Window {
    _unused: [u8; 0],
}
#[doc = "< fullscreen window"]
pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN: SDL_WindowFlags = 1;
#[doc = "< window usable with OpenGL context"]
pub const SDL_WindowFlags_SDL_WINDOW_OPENGL: SDL_WindowFlags = 2;
#[doc = "< window is visible"]
pub const SDL_WindowFlags_SDL_WINDOW_SHOWN: SDL_WindowFlags = 4;
#[doc = "< window is not visible"]
pub const SDL_WindowFlags_SDL_WINDOW_HIDDEN: SDL_WindowFlags = 8;
#[doc = "< no window decoration"]
pub const SDL_WindowFlags_SDL_WINDOW_BORDERLESS: SDL_WindowFlags = 16;
#[doc = "< window can be resized"]
pub const SDL_WindowFlags_SDL_WINDOW_RESIZABLE: SDL_WindowFlags = 32;
#[doc = "< window is minimized"]
pub const SDL_WindowFlags_SDL_WINDOW_MINIMIZED: SDL_WindowFlags = 64;
#[doc = "< window is maximized"]
pub const SDL_WindowFlags_SDL_WINDOW_MAXIMIZED: SDL_WindowFlags = 128;
#[doc = "< window has grabbed mouse input"]
pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_GRABBED: SDL_WindowFlags = 256;
#[doc = "< window has input focus"]
pub const SDL_WindowFlags_SDL_WINDOW_INPUT_FOCUS: SDL_WindowFlags = 512;
#[doc = "< window has mouse focus"]
pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_FOCUS: SDL_WindowFlags = 1024;
pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN_DESKTOP: SDL_WindowFlags = 4097;
#[doc = "< window not created by SDL"]
pub const SDL_WindowFlags_SDL_WINDOW_FOREIGN: SDL_WindowFlags = 2048;
#[doc = "< window should be created in high-DPI mode if supported."]
#[doc = "On macOS NSHighResolutionCapable must be set true in the"]
#[doc = "application's Info.plist for this to have any effect."]
pub const SDL_WindowFlags_SDL_WINDOW_ALLOW_HIGHDPI: SDL_WindowFlags = 8192;
#[doc = "< window has mouse captured (unrelated to MOUSE_GRABBED)"]
pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_CAPTURE: SDL_WindowFlags = 16384;
#[doc = "< window should always be above others"]
pub const SDL_WindowFlags_SDL_WINDOW_ALWAYS_ON_TOP: SDL_WindowFlags = 32768;
#[doc = "< window should not be added to the taskbar"]
pub const SDL_WindowFlags_SDL_WINDOW_SKIP_TASKBAR: SDL_WindowFlags = 65536;
#[doc = "< window should be treated as a utility window"]
pub const SDL_WindowFlags_SDL_WINDOW_UTILITY: SDL_WindowFlags = 131072;
#[doc = "< window should be treated as a tooltip"]
pub const SDL_WindowFlags_SDL_WINDOW_TOOLTIP: SDL_WindowFlags = 262144;
#[doc = "< window should be treated as a popup menu"]
pub const SDL_WindowFlags_SDL_WINDOW_POPUP_MENU: SDL_WindowFlags = 524288;
#[doc = "< window has grabbed keyboard input"]
pub const SDL_WindowFlags_SDL_WINDOW_KEYBOARD_GRABBED: SDL_WindowFlags = 1048576;
#[doc = "< window usable for Vulkan surface"]
pub const SDL_WindowFlags_SDL_WINDOW_VULKAN: SDL_WindowFlags = 268435456;
#[doc = "< window usable for Metal view"]
pub const SDL_WindowFlags_SDL_WINDOW_METAL: SDL_WindowFlags = 536870912;
#[doc = "< equivalent to SDL_WINDOW_MOUSE_GRABBED for compatibility"]
pub const SDL_WindowFlags_SDL_WINDOW_INPUT_GRABBED: SDL_WindowFlags = 256;
#[doc = "  \\brief The flags on a window"]
#[doc = ""]
#[doc = "  \\sa SDL_GetWindowFlags()"]
pub type SDL_WindowFlags = ::std::os::raw::c_uint;
#[doc = "< Never used"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_NONE: SDL_WindowEventID = 0;
#[doc = "< Window has been shown"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_SHOWN: SDL_WindowEventID = 1;
#[doc = "< Window has been hidden"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIDDEN: SDL_WindowEventID = 2;
#[doc = "< Window has been exposed and should be"]
#[doc = "redrawn"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_EXPOSED: SDL_WindowEventID = 3;
#[doc = "< Window has been moved to data1, data2"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MOVED: SDL_WindowEventID = 4;
#[doc = "< Window has been resized to data1xdata2"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESIZED: SDL_WindowEventID = 5;
#[doc = "< The window size has changed, either as"]
#[doc = "a result of an API call or through the"]
#[doc = "system or user changing the window size."]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_SIZE_CHANGED: SDL_WindowEventID = 6;
#[doc = "< Window has been minimized"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MINIMIZED: SDL_WindowEventID = 7;
#[doc = "< Window has been maximized"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_MAXIMIZED: SDL_WindowEventID = 8;
#[doc = "< Window has been restored to normal size"]
#[doc = "and position"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESTORED: SDL_WindowEventID = 9;
#[doc = "< Window has gained mouse focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_ENTER: SDL_WindowEventID = 10;
#[doc = "< Window has lost mouse focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_LEAVE: SDL_WindowEventID = 11;
#[doc = "< Window has gained keyboard focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_GAINED: SDL_WindowEventID = 12;
#[doc = "< Window has lost keyboard focus"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_LOST: SDL_WindowEventID = 13;
#[doc = "< The window manager requests that the window be closed"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_CLOSE: SDL_WindowEventID = 14;
#[doc = "< Window is being offered a focus (should SetWindowInputFocus() on itself or a subwindow, or ignore)"]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_TAKE_FOCUS: SDL_WindowEventID = 15;
#[doc = "< Window had a hit test that wasn't SDL_HITTEST_NORMAL."]
pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIT_TEST: SDL_WindowEventID = 16;
#[doc = "  \\brief Event subtype for window events"]
pub type SDL_WindowEventID = ::std::os::raw::c_uint;
#[doc = "< Never used"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_NONE: SDL_DisplayEventID = 0;
#[doc = "< Display orientation has changed to data1"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_ORIENTATION: SDL_DisplayEventID = 1;
#[doc = "< Display has been added to the system"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_CONNECTED: SDL_DisplayEventID = 2;
#[doc = "< Display has been removed from the system"]
pub const SDL_DisplayEventID_SDL_DISPLAYEVENT_DISCONNECTED: SDL_DisplayEventID = 3;
#[doc = "  \\brief Event subtype for display events"]
pub type SDL_DisplayEventID = ::std::os::raw::c_uint;
#[doc = "< The display orientation can't be determined"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_UNKNOWN: SDL_DisplayOrientation = 0;
#[doc = "< The display is in landscape mode, with the right side up, relative to portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_LANDSCAPE: SDL_DisplayOrientation = 1;
#[doc = "< The display is in landscape mode, with the left side up, relative to portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_LANDSCAPE_FLIPPED: SDL_DisplayOrientation = 2;
#[doc = "< The display is in portrait mode"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_PORTRAIT: SDL_DisplayOrientation = 3;
#[doc = "< The display is in portrait mode, upside down"]
pub const SDL_DisplayOrientation_SDL_ORIENTATION_PORTRAIT_FLIPPED: SDL_DisplayOrientation = 4;
#[doc = "  \\brief Display orientation"]
pub type SDL_DisplayOrientation = ::std::os::raw::c_uint;
#[doc = "< Cancel any window flash state"]
pub const SDL_FlashOperation_SDL_FLASH_CANCEL: SDL_FlashOperation = 0;
#[doc = "< Flash the window briefly to get attention"]
pub const SDL_FlashOperation_SDL_FLASH_BRIEFLY: SDL_FlashOperation = 1;
#[doc = "< Flash the window until it gets focus"]
pub const SDL_FlashOperation_SDL_FLASH_UNTIL_FOCUSED: SDL_FlashOperation = 2;
#[doc = "  \\brief Window flash operation"]
pub type SDL_FlashOperation = ::std::os::raw::c_uint;
#[doc = "  \\brief An opaque handle to an OpenGL context."]
pub type SDL_GLContext = *mut ::std::os::raw::c_void;
pub const SDL_GLattr_SDL_GL_RED_SIZE: SDL_GLattr = 0;
pub const SDL_GLattr_SDL_GL_GREEN_SIZE: SDL_GLattr = 1;
pub const SDL_GLattr_SDL_GL_BLUE_SIZE: SDL_GLattr = 2;
pub const SDL_GLattr_SDL_GL_ALPHA_SIZE: SDL_GLattr = 3;
pub const SDL_GLattr_SDL_GL_BUFFER_SIZE: SDL_GLattr = 4;
pub const SDL_GLattr_SDL_GL_DOUBLEBUFFER: SDL_GLattr = 5;
pub const SDL_GLattr_SDL_GL_DEPTH_SIZE: SDL_GLattr = 6;
pub const SDL_GLattr_SDL_GL_STENCIL_SIZE: SDL_GLattr = 7;
pub const SDL_GLattr_SDL_GL_ACCUM_RED_SIZE: SDL_GLattr = 8;
pub const SDL_GLattr_SDL_GL_ACCUM_GREEN_SIZE: SDL_GLattr = 9;
pub const SDL_GLattr_SDL_GL_ACCUM_BLUE_SIZE: SDL_GLattr = 10;
pub const SDL_GLattr_SDL_GL_ACCUM_ALPHA_SIZE: SDL_GLattr = 11;
pub const SDL_GLattr_SDL_GL_STEREO: SDL_GLattr = 12;
pub const SDL_GLattr_SDL_GL_MULTISAMPLEBUFFERS: SDL_GLattr = 13;
pub const SDL_GLattr_SDL_GL_MULTISAMPLESAMPLES: SDL_GLattr = 14;
pub const SDL_GLattr_SDL_GL_ACCELERATED_VISUAL: SDL_GLattr = 15;
pub const SDL_GLattr_SDL_GL_RETAINED_BACKING: SDL_GLattr = 16;
pub const SDL_GLattr_SDL_GL_CONTEXT_MAJOR_VERSION: SDL_GLattr = 17;
pub const SDL_GLattr_SDL_GL_CONTEXT_MINOR_VERSION: SDL_GLattr = 18;
pub const SDL_GLattr_SDL_GL_CONTEXT_EGL: SDL_GLattr = 19;
pub const SDL_GLattr_SDL_GL_CONTEXT_FLAGS: SDL_GLattr = 20;
pub const SDL_GLattr_SDL_GL_CONTEXT_PROFILE_MASK: SDL_GLattr = 21;
pub const SDL_GLattr_SDL_GL_SHARE_WITH_CURRENT_CONTEXT: SDL_GLattr = 22;
pub const SDL_GLattr_SDL_GL_FRAMEBUFFER_SRGB_CAPABLE: SDL_GLattr = 23;
pub const SDL_GLattr_SDL_GL_CONTEXT_RELEASE_BEHAVIOR: SDL_GLattr = 24;
pub const SDL_GLattr_SDL_GL_CONTEXT_RESET_NOTIFICATION: SDL_GLattr = 25;
pub const SDL_GLattr_SDL_GL_CONTEXT_NO_ERROR: SDL_GLattr = 26;
#[doc = "  \\brief OpenGL configuration attributes"]
pub type SDL_GLattr = ::std::os::raw::c_uint;
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_CORE: SDL_GLprofile = 1;
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_COMPATIBILITY: SDL_GLprofile = 2;
#[doc = "< GLX_CONTEXT_ES2_PROFILE_BIT_EXT"]
pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_ES: SDL_GLprofile = 4;
pub type SDL_GLprofile = ::std::os::raw::c_uint;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_DEBUG_FLAG: SDL_GLcontextFlag = 1;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG: SDL_GLcontextFlag = 2;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG: SDL_GLcontextFlag = 4;
pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_RESET_ISOLATION_FLAG: SDL_GLcontextFlag = 8;
pub type SDL_GLcontextFlag = ::std::os::raw::c_uint;
pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE: SDL_GLcontextReleaseFlag =
    0;
pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH: SDL_GLcontextReleaseFlag =
    1;
pub type SDL_GLcontextReleaseFlag = ::std::os::raw::c_uint;
pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_NO_NOTIFICATION:
    SDL_GLContextResetNotification = 0;
pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_LOSE_CONTEXT:
    SDL_GLContextResetNotification = 1;
pub type SDL_GLContextResetNotification = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Get the number of video drivers compiled into SDL."]
    #[doc = ""]
    #[doc = " \\returns a number >= 1 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetVideoDriver"]
    pub fn SDL_GetNumVideoDrivers() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the name of a built in video driver."]
    #[doc = ""]
    #[doc = " The video drivers are presented in the order in which they are normally"]
    #[doc = " checked during initialization."]
    #[doc = ""]
    #[doc = " \\param index the index of a video driver"]
    #[doc = " \\returns the name of the video driver with the given **index**."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDrivers"]
    pub fn SDL_GetVideoDriver(index: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Initialize the video subsystem, optionally specifying a video driver."]
    #[doc = ""]
    #[doc = " This function initializes the video subsystem, setting up a connection to"]
    #[doc = " the window manager, etc, and determines the available display modes and"]
    #[doc = " pixel formats, but does not initialize a window or graphics mode."]
    #[doc = ""]
    #[doc = " If you use this function and you haven't used the SDL_INIT_VIDEO flag with"]
    #[doc = " either SDL_Init() or SDL_InitSubSystem(), you should call SDL_VideoQuit()"]
    #[doc = " before calling SDL_Quit()."]
    #[doc = ""]
    #[doc = " It is safe to call this function multiple times. SDL_VideoInit() will call"]
    #[doc = " SDL_VideoQuit() itself if the video subsystem has already been initialized."]
    #[doc = ""]
    #[doc = " You can use SDL_GetNumVideoDrivers() and SDL_GetVideoDriver() to find a"]
    #[doc = " specific `driver_name`."]
    #[doc = ""]
    #[doc = " \\param driver_name the name of a video driver to initialize, or NULL for"]
    #[doc = "                    the default driver"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDrivers"]
    #[doc = " \\sa SDL_GetVideoDriver"]
    #[doc = " \\sa SDL_InitSubSystem"]
    #[doc = " \\sa SDL_VideoQuit"]
    pub fn SDL_VideoInit(driver_name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Shut down the video subsystem, if initialized with SDL_VideoInit()."]
    #[doc = ""]
    #[doc = " This function closes all windows, and restores the original video mode."]
    #[doc = ""]
    #[doc = " \\sa SDL_VideoInit"]
    pub fn SDL_VideoQuit();
}
extern "C" {
    #[doc = " Get the name of the currently initialized video driver."]
    #[doc = ""]
    #[doc = " \\returns the name of the current video driver or NULL if no driver has been"]
    #[doc = "          initialized."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDrivers"]
    #[doc = " \\sa SDL_GetVideoDriver"]
    pub fn SDL_GetCurrentVideoDriver() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the number of available video displays."]
    #[doc = ""]
    #[doc = " \\returns a number >= 1 or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDisplayBounds"]
    pub fn SDL_GetNumVideoDisplays() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the name of a display in UTF-8 encoding."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of display from which the name should be"]
    #[doc = "                     queried"]
    #[doc = " \\returns the name of a display or NULL for an invalid display index or"]
    #[doc = "          failure; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayName(displayIndex: ::std::os::raw::c_int)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the desktop area represented by a display."]
    #[doc = ""]
    #[doc = " The primary display (`displayIndex` zero) is always located at 0,0."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\param rect the SDL_Rect structure filled in with the display bounds"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayBounds(
        displayIndex: ::std::os::raw::c_int,
        rect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the usable desktop area represented by a display."]
    #[doc = ""]
    #[doc = " The primary display (`displayIndex` zero) is always located at 0,0."]
    #[doc = ""]
    #[doc = " This is the same area as SDL_GetDisplayBounds() reports, but with portions"]
    #[doc = " reserved by the system removed. For example, on Apple's macOS, this"]
    #[doc = " subtracts the area occupied by the menu bar and dock."]
    #[doc = ""]
    #[doc = " Setting a window to be fullscreen generally bypasses these unusable areas,"]
    #[doc = " so these are good guidelines for the maximum space available to a"]
    #[doc = " non-fullscreen window."]
    #[doc = ""]
    #[doc = " The parameter `rect` is ignored if it is NULL."]
    #[doc = ""]
    #[doc = " This function also returns -1 if the parameter `displayIndex` is out of"]
    #[doc = " range."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query the usable bounds"]
    #[doc = "                     from"]
    #[doc = " \\param rect the SDL_Rect structure filled in with the display bounds"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.5."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDisplayBounds"]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayUsableBounds(
        displayIndex: ::std::os::raw::c_int,
        rect: *mut SDL_Rect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the dots/pixels-per-inch for a display."]
    #[doc = ""]
    #[doc = " Diagonal, horizontal and vertical DPI can all be optionally returned if the"]
    #[doc = " appropriate parameter is non-NULL."]
    #[doc = ""]
    #[doc = " A failure of this function usually means that either no DPI information is"]
    #[doc = " available or the `displayIndex` is out of range."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display from which DPI information"]
    #[doc = "                     should be queried"]
    #[doc = " \\param ddpi a pointer filled in with the diagonal DPI of the display; may"]
    #[doc = "             be NULL"]
    #[doc = " \\param hdpi a pointer filled in with the horizontal DPI of the display; may"]
    #[doc = "             be NULL"]
    #[doc = " \\param vdpi a pointer filled in with the vertical DPI of the display; may"]
    #[doc = "             be NULL"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.4."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayDPI(
        displayIndex: ::std::os::raw::c_int,
        ddpi: *mut f32,
        hdpi: *mut f32,
        vdpi: *mut f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the orientation of a display."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\returns The SDL_DisplayOrientation enum value of the display, or"]
    #[doc = "          `SDL_ORIENTATION_UNKNOWN` if it isn't available."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetDisplayOrientation(displayIndex: ::std::os::raw::c_int)
        -> SDL_DisplayOrientation;
}
extern "C" {
    #[doc = " Get the number of available display modes."]
    #[doc = ""]
    #[doc = " The `displayIndex` needs to be in the range from 0 to"]
    #[doc = " SDL_GetNumVideoDisplays() - 1."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\returns a number >= 1 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDisplayMode"]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetNumDisplayModes(displayIndex: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get information about a specific display mode."]
    #[doc = ""]
    #[doc = " The display modes are sorted in this priority:"]
    #[doc = ""]
    #[doc = " - width -> largest to smallest"]
    #[doc = " - height -> largest to smallest"]
    #[doc = " - bits per pixel -> more colors to fewer colors"]
    #[doc = " - packed pixel layout -> largest to smallest"]
    #[doc = " - refresh rate -> highest to lowest"]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\param modeIndex the index of the display mode to query"]
    #[doc = " \\param mode an SDL_DisplayMode structure filled in with the mode at"]
    #[doc = "             `modeIndex`"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetNumDisplayModes"]
    pub fn SDL_GetDisplayMode(
        displayIndex: ::std::os::raw::c_int,
        modeIndex: ::std::os::raw::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get information about the desktop's display mode."]
    #[doc = ""]
    #[doc = " There's a difference between this function and SDL_GetCurrentDisplayMode()"]
    #[doc = " when SDL runs fullscreen and has changed the resolution. In that case this"]
    #[doc = " function will return the previous native display mode, and not the current"]
    #[doc = " display mode."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\param mode an SDL_DisplayMode structure filled in with the current display"]
    #[doc = "             mode"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetCurrentDisplayMode"]
    #[doc = " \\sa SDL_GetDisplayMode"]
    #[doc = " \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_GetDesktopDisplayMode(
        displayIndex: ::std::os::raw::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get information about the current display mode."]
    #[doc = ""]
    #[doc = " There's a difference between this function and SDL_GetDesktopDisplayMode()"]
    #[doc = " when SDL runs fullscreen and has changed the resolution. In that case this"]
    #[doc = " function will return the current display mode, and not the previous native"]
    #[doc = " display mode."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\param mode an SDL_DisplayMode structure filled in with the current display"]
    #[doc = "             mode"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDesktopDisplayMode"]
    #[doc = " \\sa SDL_GetDisplayMode"]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    #[doc = " \\sa SDL_SetWindowDisplayMode"]
    pub fn SDL_GetCurrentDisplayMode(
        displayIndex: ::std::os::raw::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the closest match to the requested display mode."]
    #[doc = ""]
    #[doc = " The available display modes are scanned and `closest` is filled in with the"]
    #[doc = " closest mode matching the requested mode and returned. The mode format and"]
    #[doc = " refresh rate default to the desktop mode if they are set to 0. The modes"]
    #[doc = " are scanned with size being first priority, format being second priority,"]
    #[doc = " and finally checking the refresh rate. If all the available modes are too"]
    #[doc = " small, then NULL is returned."]
    #[doc = ""]
    #[doc = " \\param displayIndex the index of the display to query"]
    #[doc = " \\param mode an SDL_DisplayMode structure containing the desired display"]
    #[doc = "             mode"]
    #[doc = " \\param closest an SDL_DisplayMode structure filled in with the closest"]
    #[doc = "                match of the available display modes"]
    #[doc = " \\returns the passed in value `closest` or NULL if no matching video mode"]
    #[doc = "          was available; call SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDisplayMode"]
    #[doc = " \\sa SDL_GetNumDisplayModes"]
    pub fn SDL_GetClosestDisplayMode(
        displayIndex: ::std::os::raw::c_int,
        mode: *const SDL_DisplayMode,
        closest: *mut SDL_DisplayMode,
    ) -> *mut SDL_DisplayMode;
}
extern "C" {
    #[doc = " Get the index of the display associated with a window."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\returns the index of the display containing the center of the window on"]
    #[doc = "          success or a negative error code on failure; call SDL_GetError()"]
    #[doc = "          for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetDisplayBounds"]
    #[doc = " \\sa SDL_GetNumVideoDisplays"]
    pub fn SDL_GetWindowDisplayIndex(window: *mut SDL_Window) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Set the display mode to use when a window is visible at fullscreen."]
    #[doc = ""]
    #[doc = " This only affects the display mode used when the window is fullscreen. To"]
    #[doc = " change the window size when the window is not fullscreen, use"]
    #[doc = " SDL_SetWindowSize()."]
    #[doc = ""]
    #[doc = " \\param window the window to affect"]
    #[doc = " \\param mode the SDL_DisplayMode structure representing the mode to use, or"]
    #[doc = "             NULL to use the window's dimensions and the desktop's format"]
    #[doc = "             and refresh rate"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetWindowDisplayMode"]
    #[doc = " \\sa SDL_SetWindowFullscreen"]
    pub fn SDL_SetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *const SDL_DisplayMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Query the display mode to use when a window is visible at fullscreen."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\param mode an SDL_DisplayMode structure filled in with the fullscreen"]
    #[doc = "             display mode"]
    #[doc = " \\returns 0 on success or a negative error code on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetWindowDisplayMode"]
    #[doc = " \\sa SDL_SetWindowFullscreen"]
    pub fn SDL_GetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *mut SDL_DisplayMode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the pixel format associated with the window."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\returns the pixel format of the window on success or"]
    #[doc = "          SDL_PIXELFORMAT_UNKNOWN on failure; call SDL_GetError() for more"]
    #[doc = "          information."]
    pub fn SDL_GetWindowPixelFormat(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = " Create a window with the specified position, dimensions, and flags."]
    #[doc = ""]
    #[doc = " `flags` may be any of the following OR'd together:"]
    #[doc = ""]
    #[doc = " - `SDL_WINDOW_FULLSCREEN`: fullscreen window"]
    #[doc = " - `SDL_WINDOW_FULLSCREEN_DESKTOP`: fullscreen window at desktop resolution"]
    #[doc = " - `SDL_WINDOW_OPENGL`: window usable with an OpenGL context"]
    #[doc = " - `SDL_WINDOW_VULKAN`: window usable with a Vulkan instance"]
    #[doc = " - `SDL_WINDOW_METAL`: window usable with a Metal instance"]
    #[doc = " - `SDL_WINDOW_HIDDEN`: window is not visible"]
    #[doc = " - `SDL_WINDOW_BORDERLESS`: no window decoration"]
    #[doc = " - `SDL_WINDOW_RESIZABLE`: window can be resized"]
    #[doc = " - `SDL_WINDOW_MINIMIZED`: window is minimized"]
    #[doc = " - `SDL_WINDOW_MAXIMIZED`: window is maximized"]
    #[doc = " - `SDL_WINDOW_INPUT_GRABBED`: window has grabbed input focus"]
    #[doc = " - `SDL_WINDOW_ALLOW_HIGHDPI`: window should be created in high-DPI mode if"]
    #[doc = "   supported (>= SDL 2.0.1)"]
    #[doc = ""]
    #[doc = " `SDL_WINDOW_SHOWN` is ignored by SDL_CreateWindow(). The SDL_Window is"]
    #[doc = " implicitly shown if SDL_WINDOW_HIDDEN is not set. `SDL_WINDOW_SHOWN` may be"]
    #[doc = " queried later using SDL_GetWindowFlags()."]
    #[doc = ""]
    #[doc = " On Apple's macOS, you **must** set the NSHighResolutionCapable Info.plist"]
    #[doc = " property to YES, otherwise you will not receive a High-DPI OpenGL canvas."]
    #[doc = ""]
    #[doc = " If the window is created with the `SDL_WINDOW_ALLOW_HIGHDPI` flag, its size"]
    #[doc = " in pixels may differ from its size in screen coordinates on platforms with"]
    #[doc = " high-DPI support (e.g. iOS and macOS). Use SDL_GetWindowSize() to query the"]
    #[doc = " client area's size in screen coordinates, and SDL_GL_GetDrawableSize() or"]
    #[doc = " SDL_GetRendererOutputSize() to query the drawable size in pixels."]
    #[doc = ""]
    #[doc = " If the window is set fullscreen, the width and height parameters `w` and"]
    #[doc = " `h` will not be used. However, invalid size parameters (e.g. too large) may"]
    #[doc = " still fail. Window size is actually limited to 16384 x 16384 for all"]
    #[doc = " platforms at window creation."]
    #[doc = ""]
    #[doc = " If the window is created with any of the SDL_WINDOW_OPENGL or"]
    #[doc = " SDL_WINDOW_VULKAN flags, then the corresponding LoadLibrary function"]
    #[doc = " (SDL_GL_LoadLibrary or SDL_Vulkan_LoadLibrary) is called and the"]
    #[doc = " corresponding UnloadLibrary function is called by SDL_DestroyWindow()."]
    #[doc = ""]
    #[doc = " If SDL_WINDOW_VULKAN is specified and there isn't a working Vulkan driver,"]
    #[doc = " SDL_CreateWindow() will fail because SDL_Vulkan_LoadLibrary() will fail."]
    #[doc = ""]
    #[doc = " If SDL_WINDOW_METAL is specified on an OS that does not support Metal,"]
    #[doc = " SDL_CreateWindow() will fail."]
    #[doc = ""]
    #[doc = " On non-Apple devices, SDL requires you to either not link to the Vulkan"]
    #[doc = " loader or link to a dynamic library version. This limitation may be removed"]
    #[doc = " in a future version of SDL."]
    #[doc = ""]
    #[doc = " \\param title the title of the window, in UTF-8 encoding"]
    #[doc = " \\param x the x position of the window, `SDL_WINDOWPOS_CENTERED`, or"]
    #[doc = "          `SDL_WINDOWPOS_UNDEFINED`"]
    #[doc = " \\param y the y position of the window, `SDL_WINDOWPOS_CENTERED`, or"]
    #[doc = "          `SDL_WINDOWPOS_UNDEFINED`"]
    #[doc = " \\param w the width of the window, in screen coordinates"]
    #[doc = " \\param h the height of the window, in screen coordinates"]
    #[doc = " \\param flags 0, or one or more SDL_WindowFlags OR'd together"]
    #[doc = " \\returns the window that was created or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateWindowFrom"]
    #[doc = " \\sa SDL_DestroyWindow"]
    pub fn SDL_CreateWindow(
        title: *const ::std::os::raw::c_char,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
        flags: Uint32,
    ) -> *mut SDL_Window;
}
extern "C" {
    #[doc = " Create an SDL window from an existing native window."]
    #[doc = ""]
    #[doc = " In some cases (e.g. OpenGL) and on some platforms (e.g. Microsoft Windows)"]
    #[doc = " the hint `SDL_HINT_VIDEO_WINDOW_SHARE_PIXEL_FORMAT` needs to be configured"]
    #[doc = " before using SDL_CreateWindowFrom()."]
    #[doc = ""]
    #[doc = " \\param data a pointer to driver-dependent window creation data, typically"]
    #[doc = "             your native window cast to a void*"]
    #[doc = " \\returns the window that was created or NULL on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateWindow"]
    #[doc = " \\sa SDL_DestroyWindow"]
    pub fn SDL_CreateWindowFrom(data: *const ::std::os::raw::c_void) -> *mut SDL_Window;
}
extern "C" {
    #[doc = " Get the numeric ID of a window."]
    #[doc = ""]
    #[doc = " The numeric ID is what SDL_WindowEvent references, and is necessary to map"]
    #[doc = " these events to specific SDL_Window objects."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\returns the ID of the window on success or 0 on failure; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\since This function is available since SDL 2.0.0."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetWindowFromID"]
    pub fn SDL_GetWindowID(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = " Get a window from a stored ID."]
    #[doc = ""]
    #[doc = " The numeric ID is what SDL_WindowEvent references, and is necessary to map"]
    #[doc = " these events to specific SDL_Window objects."]
    #[doc = ""]
    #[doc = " \\param id the ID of the window"]
    #[doc = " \\returns the window associated with `id` or NULL if it doesn't exist; call"]
    #[doc = "          SDL_GetError() for more information."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetWindowID"]
    pub fn SDL_GetWindowFromID(id: Uint32) -> *mut SDL_Window;
}
extern "C" {
    #[doc = " Get the window flags."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\returns a mask of the SDL_WindowFlags associated with `window`"]
    #[doc = ""]
    #[doc = " \\sa SDL_CreateWindow"]
    #[doc = " \\sa SDL_HideWindow"]
    #[doc = " \\sa SDL_MaximizeWindow"]
    #[doc = " \\sa SDL_MinimizeWindow"]
    #[doc = " \\sa SDL_SetWindowFullscreen"]
    #[doc = " \\sa SDL_SetWindowGrab"]
    #[doc = " \\sa SDL_ShowWindow"]
    pub fn SDL_GetWindowFlags(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    #[doc = " Set the title of a window."]
    #[doc = ""]
    #[doc = " This string is expected to be in UTF-8 encoding."]
    #[doc = ""]
    #[doc = " \\param window the window to change"]
    #[doc = " \\param title the desired window title in UTF-8 format"]
    #[doc = ""]
    #[doc = " \\sa SDL_GetWindowTitle"]
    pub fn SDL_SetWindowTitle(window: *mut SDL_Window, title: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Get the title of a window."]
    #[doc = ""]
    #[doc = " \\param window the window to query"]
    #[doc = " \\returns the title of the window in UTF-8 format or \"\" if there is no"]
    #[doc = "          title."]
    #[doc = ""]
    #[doc = " \\sa SDL_SetWindowTitle"]
    pub fn SDL_GetWindowTitle(window: *mut SDL_Window) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Set the icon for a window."]
    #[doc = ""]
    #[doc = " \\param window the window to change"]
    #[doc = " \\param icon an SDL_Surface structure containing the icon for the window"]
    pub fn SDL_SetWindowIcon(window: *mut SDL_Window, icon: *mut SDL_Surface);
}
extern "C" {
    #[doc = " Associate an arbitrary named pointer with a window."]
    #[doc = ""]
    #[doc = " `name` is case-sensitive."]
    #[doc = ""]
    #[doc = " \\param window the window to associate with the pointer"]
    #[doc = " \\param name the name of the pointer"]
    #[doc = " \\param userdata the associated pointer"]
    #[doc = " \\returns the previous value associated with `name`."]
    #[doc = ""]
    #[doc = " \\sa SDL_GetWindowData"]
    pub fn SDL_SetWindowData(
